[
  {
    "title": "Paya Ena Sandawatha",
    "artist": "Bathiya and Santhush",
    "album": "Neththara",
    "releasedYear": "2005",
    "lyricist": "Wasantha Dukgannarala",
    "lyrics": "පායා එන සඳවත මනරම්තනිකමත් බෝම සීතයිවාවාගෙන මහමෙරක තරම්උණුසුමකින් තුරුළු වෙමිදිවිය පුරා ලඟ හිඳ...මා හා සංසාරේ වෙළෙනාපිනි බිඳක් සේම පායයිඋණුසුමකින් තුරුළු වෙමිසසර පුරා ලඟ ඉඳිමිනොහඩනා දිනක් නොතිබුනාද මන්දාඔබ පෙම් හසුනක ලියනාපෙම් කවි කීවෙමි මුමුණාමඟ බලා හිදී නම්පායා එන සඳවතක තරම්තනිකමත් බෝම සීතයිවාවාගෙන මහමෙරක් තරම්උණුසුමකින් තුරුළු වෙමිදිවිය පුරා ලඟ හිඳමා හා සංසාරේ වෙළෙනාපිනි බිඳක් සේම පායයිඋණුසුමකින් තුරුළු වෙමිසසර පුරා ලඟ ඉඳිමිනොසැලෙනා සිතින් නෙලාගන්න තිබෙනානෙතු අද්දර මල් පිපෙනාහැර යන්නට සිත නෙදෙනාඅපි අපේම වේ නම්පායා එන සඳ සිසිල අරන්මා හා ඉඳ ගං ඉවුර ලඟින්උණුසුමකින් තුරුළු වෙමිදිවිය පුරා ලඟ හිඳමා හා සංසාරේ වෙළෙනාපිනි බිඳක් සේම පායයිඋණුසුමකින් තුරුළු වෙමිසසර පුරා ලඟ ඉඳිමි",
    "metaphor": "පායා එන සඳවත මනරම්",
    "meaning": "Face which is like the rising moon is beautiful",
    "source": "Face",
    "target": "Moon"
  },
  {
    "title": "Sandawathiye",
    "artist": "Ridma Weerawardena",
    "album": "Dura Akahe Master Collection by Charitha Attalage",
    "releasedYear": "2020",
    "lyricist": "Nandana Wickramage",
    "lyrics": "සඳවතියේ ඔබ මගේමයයි කියාලා මං අහස බලා උන්නාමං අහස බලා උන්නාඇසිපිය හෙලනා ඒ සුළු මොහොතේ පවා මාවලාකුලට ඔබ මුවා වෙලාඇයි මගේ සඳවතියේ රැඳෙන්නෑ මා නෙත් මානයේනිවෙන්නේ ඇයි මේ යාමයේමා රිදවනු ඇයි මා හඬවනු ඇයි සඳවතියේ මා ඇයි තනිකෙරුවේසඳවතියේ ඔබ මගේමයයි කියාලා මං අහස බලා උන්නාඅහස බලා උන්නාඇසිපිය හෙලනා ඒ සුළු මොහොතේ පවා මාවලාකුලට ඔබ මුවා වෙලාඇයි මගේ සඳවතියේ",
    "metaphor": "සඳවතියේ ඔබ මගේමයයි කියාලා",
    "meaning": "Girl you are mine",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Sandawathiye",
    "artist": "Centigradz",
    "album": "Urumaya",
    "releasedYear": "2006",
    "lyricist": "Sajith Dilpahan",
    "lyrics": "තාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නාසඳවතියේ ඔබ මුදු දෑතේවළලු හඬින් මා සිත පිබිදේඔමරි ලතා මා හද දැවටේපායන සඳ මෙන් ඔබ මා සිත බැබලේතාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නාතාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නාතාන තනාතනා නා තම් දෙනා නාහැන්දෑවේ සඳකැන් අතරේමා සෙනෙහෙ ඔබ ළඟ රැඳුනේරෑ අහසේ රන්තරු දිලිසේතනිකම ආවේ තනියට මාගේතාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නාඔය දෙතොලේ සිනහව දැකලාරන් ගොයමේ මල් පීදී නැමිලාදෙවට දිගේ තුරු වැල් සැලෙනාමන බැන්දූ ඔබේ රුව දැකලාබැන්ද වාන කුලු යතුරු සදාලාඅන්දවාන දෙදෙ... නෙකුට කියාලාකැන්දවාන අලු යන්තරෙ ඇදලාකන්දෙ බැදෙන බැත පැහැපත් කරලාතාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නාතාන තනා තම්දේ නා තම් දෙනා නාතෙතන තනා තම්දේ නා තම් දෙනා නා",
    "metaphor": "සඳවතියේ ඔබ මුදු දෑතේ",
    "meaning": "Girl with soft hands",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Heena thataketa",
    "artist": "Chillie",
    "album": "Beginning New Music",
    "releasedYear": "2012",
    "lyricist": null,
    "lyrics": "හීන තටාකෙක මූන බලාගෙන ඔබට කතා කෙරුවාපාර පුරාවට ආල නුරාවට අපට කතා හැදුනාබලා ඉන්න ඇස් දෙක දල්වාහිතේ ඇල්ම මා වෙත රන්දාමුවා වෙන්න මල් පෙති තිබ්බාසුසුම් ඇවිත් තොල් පෙති සිම්ඹාඑහෙම වෙලාවට යහන පුරාවට නුඹගෙ සුවඳ සෙව්වාහංසියේ පාන සිනාවට ලෝබ වෙලා මම කඳුලු පවා සැලුවාහීන තටාකෙක මූන බලාගෙන ඔබට කතා කෙරුවාපාර පුරාවට ආල නුරාවට අපට කතා හැදුනාබලා ඉන්න ඇස් දෙක දල්වාහිතේ ඇල්ම මා වෙත රන්දාමුවා වෙන්න මල් පෙති තිබ්බාසුසුම් ඇවිත් තොල් පෙති සිම්ඹාහංසියේ මොනවා කලත් මම ඔබට හෘදෙ පිදුවාමගෙ හීන ලොවේ පෙම් රැජින වෙලා ඔබ තුරුලු වෙලා හිටියා පපුවටහීන තටාකෙක මූන බලාගෙන ඔබට කතා කෙරුවාපාර පුරාවට ආල නුරාවට අපට කතා හැදුනා",
    "metaphor": "හීන තටාකෙක",
    "meaning": "Speaker had a conversation with the listener while both were in a dreamlike state or environment",
    "source": "Dreams",
    "target": "Pool"
  },
  {
    "title": "Oba Magemai",
    "artist": "Ranindu",
    "album": "Oba Magemai",
    "releasedYear": "2003",
    "lyricist": "Chanaka Jayasekara",
    "lyrics": "උණුසුම් වූ මේ කුරිරු ලොවේඇයිද මා මෙසේ තනි කෙරුවේමා ළය උණු වී හඩා වැටෙන විටඔබ වෙනතක දැන් බලවිදෝදිවිය පුරා මා ඔබ රකිමිමනුදම් ගුණදම් කියාදෙමිඔබ මගෙමයි මා ඔබෙමයිසසර පුරා අප සිටින තුරාගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයිගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයි(Wowwooho ho ho ho)(Yeay yeay yeah yeah yeah)අඳුරු වූ මේ සැහැසි ලොවේඔබයි මමයි ආලෝකය වේආදරයට ලෝකය හඬනා විටඔබයි මමයි වෙනතක යාදෝගහකොළ ඇලදොළ අපේ තමයිපුංචි පැටව් රැල අපේ තමයිමා මෙන් ඔබ මෙන් අපේ ලෝකයක්රැකෙන්නේ අප රැකුනොත් පමණයිගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයිගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයිසසර අප සිටින තුරාගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයිගලා හැලෙන නිල් නදිය ඔබයිදොරේ ගලා යන සෙනෙහෙ ඔබයිහිමිදිරි උදයේ සුවය ඔබයිමගේ දිවිය හිමිකාරී ඔබයි",
    "metaphor": "ගලා හැලෙන නිල් නදිය ඔබයි",
    "meaning": "You are beautiful just like a flowing blue river",
    "source": "Person",
    "target": "Blue River"
  },
  {
    "title": "Mal Pen Podak",
    "artist": "Bathiya and Santhush",
    "album": "Tharunyaye",
    "releasedYear": "2002",
    "lyricist": "Wasantha Dukgannarala",
    "lyrics": "මගෙ සිහිනේ ඔබයිමගෙ සිහිනේ ඔබයිතනි යහනේ නොවෙයිආදරයේ හද උණුසුම ඔබයිඔබෙ සෙනෙහේ මගෙයිඔබෙ සෙනෙහේ මගෙයිතනි යහනේ නොවෙයිආදරයේ ඔබ මුතුලැල් වටීමගෙ සිහිනේ ඔබයිඔබෙ සෙනෙහේ මගෙයිතනි යහනේ නොවෙයි (නොවෙයි)ආදරයේ හද උණුසුම ඔබයිමල් පැන් පොදක් කිනිත්තක් අගින්ඉසින්නා වගෙයි මට ඔබේ ආදරේ...!!මල් පැන් පොදක් කිනිත්තක් අගින්ඉසින්නා වගෙයි මට ඔබේ ආදරේ...!!නෙළුමක් නෙළුමක් අරං...මගෙ සිහිනේ ඔබයිඔබෙ සෙනෙහේ මගෙයිතනි යහනේ නොවෙයි (නොවෙයි)ආදරයේ හද උණුසුම ඔබයිඔබගෙන් තරම් ලැබූ පෙම් වදන්ඉතිං ආදරෙයි නම් බෝහෝමයි හැගුම්...!!ඔබගෙන් තරම් ලැබූ පෙම් වදන්ඉතිං ආදරෙයි නම් බෝහෝමයි හැගුම්...!!අහසක් අහසක් තරම්.මල් පැන් පොදක් කිනිත්තක් අගින්ඉසින්නා වගෙයි මට ඔබේ ආදරේ...!!ඔබගෙන් තරම් ලැබූ පෙම් වදන්ඉතිං ආදරෙයි නම් බෝහෝමයි හැගුම්...!!මල් පැන් පොදක් කිනිත්තක් අගින්ඉසින්නා වගෙයි මට ඔබේ ආදරේ...!!ඔබගෙන් තරම් ලැබූ පෙම් වදන්ඉතිං ආදරෙයි නම් බෝහෝමයි හැගුම්...!!මල් පැන් පොදක්...",
    "metaphor": "මගෙ සිහිනේ ඔබයි",
    "meaning": "Having strong feelings for a person",
    "source": "Person",
    "target": "Dream"
  },
  {
    "title": "Hada Salena",
    "artist": "Aruna Liyan",
    "album": "Hada Salena",
    "releasedYear": "2008",
    "lyricist": "Hemasiri Halpita",
    "lyrics": "නිල් නුවන් හසකැලුම් – පවසමින් පෙම් හැගුම්ජීවිතයේ, . යෞවනයේ, දකිනා.  සුර ළදුන් සෙනෙහසින් – මගෙ පැතුම් සරසමින්මා දෙනෙතේ... මා මනසේ... රැදුනා.හදසැලෙනා. රැයේ හිම සිසිලේ...රහසේ. අහසේ ඈත ඉමේමුතු වරුසා, සැලුනා තාම මැවේ...නෙබිදී නොමැකී ඒ මතකේ...සිතු ලෙසින් සැනසෙම්න් – නිදහසෙන් නැලවෙමින්මගෙ දිවියේ. ඒ යුගයේ තිබුනාදහසකින් සුව දසුන්, පහසකින් ලද රසින්මෝහනයේ... සත්සරයේ රැදුනා.හදසැලෙනා. රැයේ හිම සිසිලේ...රහසේ. අහසේ ඈත ඉමේමුතු වරුසා, සැලුනා තාම මැවේ...නෙබිදී නොමැකී ඒ මතකේ...හදසැලෙනා. රැයේ හිම සිසිලේ...රහසේ. අහසේ ඈත ඉමේ...හදසැලෙනා. රැයේ හිම සිසිලේ...රහසේ. අහසේ ඈත ඉමේමුතු වරුසා, සැලුනා තාම මැවේ...නෙබිදී නොමැකී ඒ මතකේ...//",
    "metaphor": "මුතු වරුසා, සැලුනා තාම මැවේ",
    "meaning": "Continue to experience or observe something that is very valuable or precious to them, as if it were raining down from the sky in abundance.",
    "source": "Rain",
    "target": "Pearl"
  },
  {
    "title": "Diwyanganawee",
    "artist": "Prasanga Thisera",
    "album": "Diwyanganawee",
    "releasedYear": "2018",
    "lyricist": "Sampath Fernandopulle",
    "lyrics": "සිතින් ප්‍රේම වඩනාමා සුරංගනාවීමගේ ලයේ දැවටීදුක් තැවුල් නිවාවීතාරකා රිදී සිනාවන්අහස්කුස මැවූ රටාවන්පීදෙනා මගේ හැගුම් සිත්තම්මා දිව්‍යය අංගනාවීදේදුන්නේ හීන කැන්දූනීල වර්ණේනේත්‍රා මනරම්රෑ කාලේ සේද රැන්දූකේෂ සේනා මවනා සිතුවම්සිතින් ප්‍රේම වඩනාමා සුරංගනාවීමගේ ලයේ දැවටීදුක් තැවුල් නිවාවීතාරකා රිදී සිනාවන්අහස්කුස මැවූ රටාවන්පීදෙනා මගේ හැගුම් සිත්තම්මා දිව්‍යය අංගනාවීහැන්දෑවේ සයුරු තීරේකීව ගීතේ මාත්‍රා හුරතල්මල් වාගෙ කෝල බැල්මපෑයු මූනේ මායා විකුමන්මාලතී කොපුල් සිනාසීආදරේ දෝර ගලාවීසුසුම් වැල් දෑසේ මියැදීසිතින් ප්‍රේම වඩනාමා සුරංගනාවීමගේ ලයේ දැවටීදුක් තැවුල් නිවාවීතාරකා රිදී සිනාවන්අහස්කුස මැවූ රටාවන්පීදෙනා මගේ හැගුම් සිත්තම්මා දිව්‍යය අංගනාවීසිතින් ප්‍රේම වඩනාමා සුරංගනාවීමගේ ලයේ දැවටීදුක් තැවුල් නිවාවීතාරකා රිදී සිනාවන්අහස්කුස මැවූ රටාවන්පීදෙනා මගේ හැගුම් සිත්තම්මා දිව්‍යය අංගනාවී",
    "metaphor": "තාරකා රිදී සිනාවන්",
    "meaning": "Smiles described as dazzling or brilliant, like stars in the night sky",
    "source": "Smile",
    "target": "Silver Stars"
  },
  {
    "title": "Neela Dase",
    "artist": "Romesh & Lakshan",
    "album": null,
    "releasedYear": "2007",
    "lyricist": "Rinaz Mohomad",
    "lyrics": "නීල දෑසේ දුටුවා ඔබෙ පේ‍්‍රම ආලිංගයේගීත රාවේ දැනුනා සොඳුරු දෙහද රන් සත්සරේමාහදේ වෙළෙනා ඔබ මගේ සිහිනේ පිරුනාමිහිරාවියේ මාගේමුලකුරු ඔබයි මාගේ සෙනෙහසේ හොඩියේපිංචිලා ලියවූ දිනේසිත පෙම් පුරන මං සොයන මා ජීවිතේඅනිමි සේ බැඳුනා නිල් නෙත් යුග මාමා හදේ වෙළෙනා ඔබ මගේ සිහිනේ පිරුනාමතකයන් වාගේහදවත උයන් තෙරේ පිනූ රස පළ වැලේඔබ තමා නොඉඳුල් පළේරස සොයන බිඟු කැලක විස දළ තුඩින්සඳවමි දිවිපුරා මාගේ ආදරේමා හදේ වෙළෙනා ඔබ මගේ සිහිනේ පිරුනාමතකයන් මාගේනීල දෑසේ දුටුවා ඔබෙ පේ‍්‍රම ආලිංගයේගීත රාවේ දැනුනා සොඳුරු දෙහද රන් සත්සරේමාහදේ වෙළෙනා ඔබ මගේ සිහිනේ පිරුනාමිහිරාවියේ මාගේ",
    "metaphor": "මුලකුරු ඔබයි මාගේ සෙනෙහසේ හොඩියේ",
    "meaning": "You are the starting point or foundation of the my love, and that they are very important to the me",
    "source": "My love",
    "target": "Initials"
  },
  {
    "title": "Radhawani",
    "artist": "Supun Perera",
    "album": "Mahamaya Memories of a Lifetime",
    "releasedYear": "2020",
    "lyricist": "Chandrasena Thalangama",
    "lyrics": "නීල නුවන් සනසන්නම්රාධාවණී, මා එන්නම්වීණා සරින් නලවන්නම්රාධාවණී, මා එන්නම්මියුරු හඬින් මා වෙත ළං, ළං වෙන්නාතුරුලු වෙලා මුව සිපගන්නම් මානුරාගිනීයේනේක අනන්තවු ගී ස්වර ගයන්නම්දෙඅදර සඳ කැන් දහර ඉසින්නීසොඳුරු සරාගී නෙත ලෙලවන්නීරූබර රාධා, මා මන බන්ඳාහැරදා යනු බෑ, මා ප්රිය රාධානීල නුවන් සනසන්නම්රාධාවණී, මා එන්නම්වීණා සරින් නලවන්නම්රාධාවණී, මා එන්නම්මියුරු හඬින් මා වෙත ළං, ළං වෙන්නාතුරුලු වෙලා මුව සිපගන්නම් මානුරාගිනීයේනේක අනන්තවු ගී ස්වර ගයන්නම්",
    "metaphor": "නීල නුවන්",
    "meaning": "calm, serene, or peaceful eyes of a girl",
    "source": "Eyes",
    "target": "Calmness"
  },
  {
    "title": "Sansarini",
    "artist": "Yasas Medagedara",
    "album": "Sansarini",
    "releasedYear": "2019",
    "lyricist": "Sajith Akmeemana",
    "lyrics": "කඳුලයි පවසන්නේ සැඟවූ ඒ ආදරේඅදමයි මා දන්නේ නොකියූ ඒ ආදරේකඳුලයි පවසන්නේ සැඟවූ ඒ ආදරේඅදමයි මා දන්නේ නොකියූ ඒ ආදරේසඳේ මං කෙසේ කියන්නේහිතේ තියෙන ඒ ආදරයමා මන්මත් කෙරූවා කියා ඔබ දුටූදානෙතේ වේදනා නිවෙන්නේඔබේ රූ නිසාහිත පාවෙලා දුර ගියාපෙම් වර්ෂා වහී මා තෙමාසිත් සංකා නිවී යයි මෙදාසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේදේදුන්නේ පවා නැති සොබා රූපේහැංගෙන්නේ ඔබේ ළඟ තමාකුළුඳුලේ මාගේ ප්රේමාදරේනේක වාරේ බැඳේ හදවතේපෙම් වර්ෂා වහී මා තෙමාසිත් සංකා නිවී යයි මෙදාසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේසඳේ මං කෙසේ කියන්නේහිතේ තියෙන ඒ ආදරයමා මන්මත් කෙරූවා කියා ඔබ දුටූදානෙතේ වේදනා නිවෙන්නේඔබේ රූ නිසාහිත පාවෙලා දුර ගියාපෙම් වර්ෂා වහී මා තෙමාසිත් සංකා නිවී යයි මෙදාසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේසංසාරිණී මගේනන්නාඳුනන්නියේමා මවනා හීනයේඔබ ඉන්නවා වගේසංසාරිණී මගේ",
    "metaphor": "පෙම් වර්ෂා",
    "meaning": "Large or abundant amount of love",
    "source": "Love",
    "target": "Rain"
  },
  {
    "title": "Prathihari",
    "artist": "Supun Perera",
    "album": "Prathihari",
    "releasedYear": "2019",
    "lyricist": "Shehan Galahitiyawa ",
    "lyrics": "ප්රාතිහාරී නුරා ගේනාමීන දෑසේ මවා ආශාරූපසාරි මැවී පේනාචන්ද්රශෝභා රසේ පානාමන ආශා රටා පානාහිත පෑහී සොබා ගේනානේත්රා මානනාසිත පාරා පෑ සිනාසීමා නෑ සිතාඉඟි පානා දෑසිනාසිහින යායේ සරා මා හාඑනවාදෝ මවා සේයාප්රේම හීනේ සොබා ගේනාසේයා රෑගෙනානිම නේනා කාරණාඡායා රූ මවානෙතු පේනා රෑ දිවාසිහින යායේ සරා මා හාඑනවාදෝ මවා සේයාප්රේම හීනේ සොබා ගේනාප්රාතිහාරී නුරා ගේනාමීන දෑසේ මවා ආශාරූපසාරි මැවී පේනාචන්ද්රඔශෝභා රසේ පානාමන ආශා රටා පානාහිත පෑහී සොබා ගේනාහිත පෑහී සොබා ගේනාප්රේම හීනේ සොබා ගේනා",
    "metaphor": "මීන දෑසේ",
    "meaning": "Eyes that are mysterious, intuitive, or emotional",
    "source": "Eyes",
    "target": "Pisces"
  },
  {
    "title": "Sandanaari",
    "artist": "Harsha Withanage",
    "album": "Sandanaari",
    "releasedYear": "2018",
    "lyricist": "Shehan Galahitiyawa ",
    "lyrics": "හුස්මේ සැමදා රැඳුනාසඳනාරී උපමා මැවුනාවැස්සේ සිතුසේ තෙමුනාකිඳුරාවී මනසේ ඇඳුනානෙතු යාවී බැඳීලා සදා,හීන ගානේ රැයේහී පවාසඳසේයා වතේහී මවා,පිනි සීතේ දැනේවී කතාසුසුම් අංශු පාසා සුපෙම්වන්ත ආශාරෑක මදනල ගවසාහැඟුම් රංචු වීලා රැයේ පින්න පීරාමීන ඇසිපිය සලලාසිතේ හැඟුම කොඳුරා සදා මටම ලැබෙනා නාරී,සදා මාගෙ වීලානෙතු යාවී බැඳීලා සදා,හීන ගානේ රැයේහී පවාසඳසේයා වතේහී මවා,පිනි සීතේ දැනේවී කතාරැඳී ඉන්න මාහා සුපෙම් බැල්ම පාලාසේද රතඳර මුමුනාරැයේ නින්දෙ පායා මවා දුන්නු සේයාදෑත සසරෙම අමුනාසිතේ හැඟුම කොඳුරා සදා මටම ලැබෙනා නාරී,සදා මාගෙ වීලානෙතු යාවී බැඳීලා සදා,හීන ගානේ රැයේහී පවාසඳසේයා වතේහී මවා,පිනි සීතේ දැනේවී කතාහුස්මේ සැමදා රැඳුනාසඳනාරී උපමා මැවුනාවැස්සේ සිතුසේ තෙමුනාකිඳුරාවී මනසේ ඇඳුනානෙතු යාවී බැඳීලා සදා,හීන ගානේ රැයේහී පවාසඳසේයා වතේහී මවා,පිනි සීතේ දැනේවී කතා",
    "metaphor": "සඳනාරී",
    "meaning": "A girl who is bright and pretty as the moon",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Nura Wasanthe",
    "artist": "Nadeemal Perera",
    "album": "Nura Wasanthe",
    "releasedYear": "2018",
    "lyricist": "Uma Aseni",
    "lyrics": "අඳුරේ ගිලී තනිවීලා මෙසේනාඬන් ඉතින් සොඳුරී මගේනොසිතා සිතා අතීතේ එදාබිඳුනාට මණිමේඛලාපිලිගන්නෙ මා නුඹ සීතාව සේහද මන්දිරේ සරසලාඅඳුරේ ගිලී තනිවීලා මෙසේනාඬන් ඉතින් සොඳුරී මගේනොසිතා සිතා අතීතේ එදාබිඳුනාට මණිමේඛලාපිලිගන්නෙ මා නුඹ සීතාව සේහද මන්දිරේ සරසලාගංගා තරංගා පරදන්නෙපාඔය දෑස කඳුළින් තෙමාපාවී ගියාවේ අතීතේ කතාසැඩ මාරුතේ රැලි හමානළලේ නුඹේ ඇන්ද තිලකේ පවාකියාවී මගේ ප්රාර්ථනාප්රේමේ නුරා වසන්තේ ගෙනාපින්සාර ළඳ නුඹ නිසාපිලිගන්නෙ මා නුඹ සීතාව සේහද මන්දිරේ සරසලාඔය දෑසෙ පා ඒ මන බන්දනාපෙම්වන්ත සුරතල් සිනාසැනසෙන්න මාගේ ළයේ සැතපිලානව සඳ දිහා බල බලාභවයෙන් භවේ එන්න මතු ඉපදෙනාසංසාර පතිනිය වෙලාප්රේමේ නුරා වසන්තේ ගෙනාපින්සාර ළඳ නුඹ නිසාපිලිගන්නෙ මා නුඹ සීතාව සේහද මන්දිරේ සරසලාප්රේමේ නුරා වසන්තේ ගෙනාපින්සාර ළඳ නුඹ නිසාපිලිගන්නෙ මා නුඹ සීතාව සේහද මන්දිරේ සරසලා",
    "metaphor": "පෙම්වන්ත සුරතල් සිනා",
    "meaning": "Someone's smile is warm, affectionate, or sincere, and that it reflects the love they feel towards someone else.",
    "source": "Smile",
    "target": "Love"
  },
  {
    "title": "Sandaganawa",
    "artist": "Dhanith Sri",
    "album": "Sandaganawa",
    "releasedYear": "2019",
    "lyricist": "Dhanith Sri",
    "lyrics": "උදුල තරු මේ අහස් තලයෙන් වසන් වී වාගේමාර සේනා හදට කැන්දන යාමේ ලං වූයේමේඝ වර්ෂා ගලා හැලුනේ සේද යහනාවේදෝරෙ යන මේ හැගුම් ගංගා ඔහේ සැලුනාවේසඳගනාවට සඳලුතල සිප සුවදෙන යාමයේඋණුහුමේ ගිරි තුඩට මී පැණි ගෙනේවීරාත්රියේ ආයේකාලෙකින් මං ආවෙ නැත්තේ පහල ගංතීරේඉවුරු තල සිප ගන්න අවසර දේද හිත කීවේගෙවී යන මේ භවේ ජීවිත ගානේ සංසාරේමගෙම වී පතිනිය නුඹේ දිවි ගෙවේවා නිබඳේසඳගනාවට සදලුතල සිප සුවදෙන යාමයේඋණුහුමේ ගිරි තුඩට මී පැණි ගෙනේවීරාත්රියේ ආයේ",
    "metaphor": "සඳගනාවට",
    "meaning": "Girl who is very attractive or captivating, and who has a peaceful or serene demeanor",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Dura Akahe",
    "artist": "Charitha Attalage",
    "album": "Mahamaya Memories of a Lifetime",
    "releasedYear": "2020",
    "lyricist": "Chandrasena Thalangama",
    "lyrics": "හිටි හැටියේම ඇද හැලුණු වැස්ස වගෙයිඔබ හමුවූයේ කවදාද මතක නැතෙයිඒ හැමදේම සිහිවෙද්දී හිතට දුකයිඅප හමුවූයේ මොනවටද කියලා හිතෙයිඅප හමුවූයේ මොනවටද කියලා හිතෙයිඅප හමුවූයේමේ හඳපාන, මේ තරු රෑනමේ හඳපාන, මේ තරු රෑනහඳපාන තරු රෑන ඔච්චම් කලයිමට ඔච්චම් කලයිහැමදාම ඔය මුහුණ මතකේ තියෙයිමට මතකේ තියෙයිදුර ආකාහේ රෑ හැමදාමදුර ආකාහේ රෑ හැමදාම (Ravi Jay, Charitha)(Chandrasena Thalangama)දුර බලං අපි අපිව හෙව්වාදිලිසෙන තරුවල අපිව මැව්වාඅර තරුව නුඹ, අර තරුව මමඈත බලාගෙන නුඹ ආකාසෙට කිව්වා, ඒත්නුඹ මා හා පරතරයඅතරක ඇති දුර අලෝක වර්ෂනුඹ දකින්නෙ අද, මගෙ අතීතයනිවි-නිවි දැවෙන්නෙ මගෙ අතීතයමතකෙට ඒනා මතකේ වියෝවක්වන බව දැන උන්නා මගදි මං කෝමත්ගැලපෙන තෙක් බලා උන්නා මෙතෙක් දුරටඒත් අපෙ හිත් ගැලපුනෙ නැතේහැමදේම වෙන්නෙ ආදරේකට වඩාදෙන්නෙක් අතර ඇති අවබෝධෙ මතමම හෙව්වෙ මාවඔයා මාව හොයාගනිද්දි දුර තරුවෙලා කලුකුහරහඳපාන තරු රෑන ඔච්චම් කලයිමට ඔච්චම් කලයිහැමදාම ඔය මුහුණ මතකේ තියෙයිමට මතකේ තියෙයිහිටි හැටියේම ඇද හැලුණු වැස්ස වගෙයිඔබ හමුවූයේ කවදාද මතක නැතෙයිඒ හැමදේම සිහිවෙද්දී හිතට දුකයිඅප හමුවූයේ මොනවටද කියලා හිතෙයිඅප හමුවූයේ මොනවටද කියලා හිතෙයිඅප හමුවූයේදුර ආකාහේ රෑ හැමදාමදුර ආකාහේ රෑ හැමදාම (Ravi Jay, Charitha)(Chandrasena Thalangama)ඔයා ගැන මං මැව්වඔයා වෙනුවෙන් කිව්වඔයා ගැන විඳගන්නප්රසංගයට එන්නඔයා වෙනුවෙන් මැව්වඔයා ගැන මම කිව්වඔයා ගැන විඳගන්නප්රසංගයට එන්න",
    "metaphor": "අර තරුව නුඹ",
    "meaning": "Someone who is bright and shines like a star",
    "source": "Person",
    "target": "Star"
  },
  {
    "title": "Galana Ganga",
    "artist": "Charitha Attalage",
    "album": "Galana Ganga",
    "releasedYear": "2017",
    "lyricist": "Charitha Attalage",
    "lyrics": "YaRavi JayCharithaWestනාහිරනීල දෑස හා දොඩවන්නම්වළලු හඬට මම මත් වෙන්නම්නීල වරල මා සිඹ ගන්නම්හීන මවා මට කතා කරන්ගලන ගඟක රළ වාගේනිමාවක් නෑ නේඔබෙ රූ වරුනේක්ෂිතිජයක ඉමක් ගානේනිමාවක් නෑ නේඔබෙ රූ වරුනේලෞකික සැපකාලය කාදැමීමක් නිබ්බාණෙට පිවිසෙන්නපංචස්කන්ධයක අස්ථිර ගතිය මෙනෙහි මෙනෙහිමං තපසෙක්ම විය නුඹ දකින්න පෙරඔයාගෙ ළපටි තඹර දෙකොපුලතුහින වැටි දිළිසෙයි ඝණ අඳුර මතඇසට නොපෙනෙන පර්වතෙක සුන්දර බව විඳපු මටඔයාගෙ රුව දැක බිඳුනා මගෙ සමවැදිසිටි දැහැන මෙතුකලක් කැළඹිලාසම්මාදිට්ඨිය මගෙ අද නතරවෙලාඔයාගෙ නෙතුමුල, මගෙ හේතුඵලගොළුවෙලා අන්ධව අතර මග කිමදඝන්ධකුටියෙන් හිමිට බැස සීලය පසෙක දමාවිදනසින් වැද රූපයක සොබාඑතෙර වෙන්න මං ගිය සසර මග පෙරටඔයා ඇවිත් අද තෘෂ්ණාවක් වෙලානීල දෑස හා දොඩවන්නම්වළලු හඬට මම මත් වෙන්නම්නීල වරල මා සිඹ ගන්නම්හීන මවා මට කතා කරන්ගලන ගඟක රළ වාගේනිමාවක් නෑ නේඔබෙ රූ වරුනේක්ෂිතිජයක ඉමක් ගානේනිමාවක් නෑ නේඔබෙ රූ වරුනේ",
    "metaphor": "ළපටි තඹර දෙකොපුල",
    "meaning": "Someone has a youthful or inexperienced perspective on things",
    "source": "Eyes",
    "target": "Young Lotus"
  },
  {
    "title": "Labendiye",
    "artist": "Lahiru Perera",
    "album": "Gold",
    "releasedYear": "2021",
    "lyricist": "Manuranga Wijesekara",
    "lyrics": "ඔබ එන්න සුළඟේ දැවටිලාමා ඉන්නේ ඔබ දැන් එයි කියාසුදු හංස තටුවේ සැතපිලාපෙම් කරමු රහසේ සැඟවිලාළබැඳියේළබැඳියේමා සිතින් සිරකලාළබැඳියේළබැඳියේමා සිතින් පෙම් කලානා දල්ල වාගේ දිදුලනාමුදු හාදු වැස්සෙන් මා තෙමාඔය දෙතොල් අතරේ හිරවෙලාමට ඉන්න ඇත්නම් තනිවෙලාළබැඳියේළබැඳියේමා සිතින් සිරකලාළබැඳියේළබැඳියේමා සිතින් පෙම් කලාකිරි කවඩි මාලේ මා ගොතාඔය ගෙලේ පළදා හැඩ බලාමා වින්ද සතුටේ නිම් සොයාඔබ යන්න සුලඟේ අප දමාළබැඳියේළබැඳියේමා සිතින් සිරකලාළබැඳියේළබැඳියේමා සිතින් පෙම් කලා",
    "metaphor": "මුදු හාදු වැස්සෙන්",
    "meaning": "Showing a lot of affection or love",
    "source": "Love",
    "target": "Rain"
  },
  {
    "title": "Liyathambara",
    "artist": "Athma Liyanage",
    "album": "Liyathambara",
    "releasedYear": "2022",
    "lyricist": "Rohana Jayasinghe",
    "lyrics": "ලියතඹරා.... මුදු කුසුමකී ඈතව්සන්ගේ.... දෑහෙනේ සම විදිනානෑ ලොකේ ජීවේ ඈයයි...නෑ ලොකේ ජීවේ ඈයයි....//මායාව මායාව  ලොව රවටනාසිහිනයකි සිහිනයකි අදුරේ පාවෙනාවීනාවේ තත් අතර මුදු ස්වරේ ඈයමයිම හදට රස ගෙනෙන මදූවිත ඈයයිලියතබරා.... //මිරිගුවකි මිරිගුවකි අප රවටනාදුර ඈත සිතිජයකි ඉම නොපෙනෙනානිල් නයන බිගු දෑලකිනෙත් සරය සුමුදුයිමගෙ ජීවේ වෑලි කතරේ දිය බිද ඈයයිලියතබරා.... //",
    "metaphor": "මුදු කුසුමකී ඈ",
    "meaning": "Girl that is described is gentle, fragile, or sensitive",
    "source": "Girl",
    "target": "Delicate Flower"
  },
  {
    "title": "Heenayaki Mata Adare",
    "artist": "Kasun Kalhara",
    "album": "Adaraneeya Wassanaya",
    "releasedYear": "2002",
    "lyricist": "Upul Shantha Sannasgala",
    "lyrics": "හා.. හා.. හා.. හා..හ්ම්.. හ්ම්.. හ්ම්..හීනයකි මට ආදරේහැඟෙනවා මට ජීවිතේහිනයට ළඟ ජිවිතේහැඟෙනවා ඔබෙ ආදරේවැටෙනකොට කඳුළු ඇවිලිලාසුවඳ මල් පෙති පරවෙලාසුවඳ මල් පෙති පරවෙලාවස්සාන සිහිනේ ඇවිලිලාසුසුමේ තවරා සැඟවු සිහිනේසුසුමේ තවරා සැඟවු සිහිනේආ....ආ....ආ....ආදරණීය වස්සානේආ....ආ....ආ....ආදරණීය වස්සානේආ....ආ....ආ....ආදරණීය වස්සානේආ....ආ....ආ....ආදරණීය වස්සානේ",
    "metaphor": "හීනයකි මට ආදරේ",
    "meaning": "Love is something that is desirable or aspirational for the speaker, and that they long for it or hope to experience it in their life",
    "source": "Love",
    "target": "Dream"
  },
  {
    "title": "Himaleta Wada Usai",
    "artist": "Jude Rogans",
    "album": null,
    "releasedYear": "2014",
    "lyricist": "Dilan Gamage",
    "lyrics": "හිමාලෙට වඩා උසයි සෙනෙහස පපු කඳේ..කසාය පරාදයි වරදෙදි සැර ඔබේ..ඇහැ ගහගෙන සිටී සමාජෙ ගැන කියයි..හොද මිනිහෙක් වෙයන් නිතරම මට කියූ..ආදර මගෙ තාත්තේ...////දරදඬු හිත මගේ - අයාලෙ ගිය දිනේ..කඳුලැල් මොනතරම් - පිරුනද ඔය නෙතේ..ඒ ඔවදන් මා සුමඟට - ගෙන මිස නෑ හැර ගියේ..අද මා සිටිනා තැන දැක - සතුටින් අවවාද දේ..හොද මිනිහෙක් වෙයන් - නිතරම මට කියූ..මතු සසරෙත් පතන්නෙ - ඔබමයි තාත්තේ..හිමාලෙට වඩා උසයි...කරදර ආ මගේ - නොබියව ලඟ හිදී..දියුණුව දැක මගේ - ආශිර්වාද දේ..නොදකින දෙවියන් වැන්දද - ඔබමයි දෙවියන් වුනේ..උපදින හැම භවයකදිම - වෙන්නද මම පුතු ඔබේ..හොද මිනිහෙක් වෙයන් - නිතරම මට කියූ..මතු සසරෙත් පතන්නෙ - ඔබමයි තාත්තේ..හිමාලෙට වඩා උසයි...",
    "metaphor": "හිමාලෙට වඩා උසයි සෙනෙහස පපු කඳේ",
    "meaning": "Love is something that rises above all other things, and that it is an important or central part of one's life",
    "source": "Love",
    "target": "Himalaya height"
  },
  {
    "title": "Ahasin Eha",
    "artist": "Kasun Kalhara",
    "album": "Adaraneeya Kathawak",
    "releasedYear": "2016",
    "lyricist": "Nilar N. Cassim",
    "lyrics": "අහසින් එහාතරු මං දිගේපියඹන්න දැන්විහඟෙකු ලෙසින්අහසින් එහාසිහිනය දිගේපියඹන්න නම්ආසයි ඉතිංහිත කළඹමින්හැඟුමන් එබීඔච්චම් කළේකවදාක හෝනොදැනුණු ලෙසින්හද ගී පොතේසත්සර නැගීඒ ආදරේසිතුවිලි කුසුම්විකසිත වෙමින්මකරන්ද සුවඳින් පිරේඔබගේ හඬින්විවරණ අරන්ජීවිතය ගීයක් වුනේදවසක උතුම්කිරුළක් දරන්ඔබ එන්න රැජිනක් ලෙසින්හිත කළඹමින්හැඟුමන් එබීඔච්චම් කළේකවදාක හෝනොදැනුණු ලෙසින්අහසින් එහාතරු මං දිගේපියඹන්න දැන්විහඟෙකු ලෙසින්අහසින් එහාසිහිනය දිගේපියඹන්න නම්ආසයි ඉතිංහිත කළඹමින්හැඟුමන් එබීඔච්චම් කළේකවදාක හෝනොදැනුණු ලෙසින්හද ගී පොතේසත්සර නැගීඒ ආදරේ",
    "metaphor": "සිතුවිලි කුසුම්",
    "meaning": "Thoughts or ideas that are beautiful, delicate, or refined",
    "source": "Thought",
    "target": "Flower"
  },
  {
    "title": "Sandawatha Ahasin",
    "artist": "MG Dhanushka",
    "album": null,
    "releasedYear": "2014",
    "lyricist": "Saman Edirimuni",
    "lyrics": "සදවත අහසින් වැටිලා උන්නද මන්දා මිදුලේනොකියම ඔය හිත උදුරන් යන්නට හිතුනා කෙල්ලේතනි වූ වෙලාවක ඔබ මගේ ලග ඉන්න මා හැරදා නොයා...පපුවේ තියා හිස ඉල්ලුවොත් හිත දෙනව මං නොමිලෙම ලියා...මගේ පාළු ජීවිතේ තනියට තනිකම රැදුණේඔය නුහුරු නෙතු බැල්මේ හුරු හිතවත්කම තිබුණේ තනි වූ වෙලාවක ඔබ මගේ ලග ඉන්න මා හැරදා නොයා...පපුවේ තියා හිස ඉල්ලුවොත් හිත දෙනව මං නොමිලෙම ලියා...දිගු නීල ඇස් රහසේ ඉගලෙයි නොපෙනෙන මානේමගේ හීන මට ඕනේ කවදද ඔබ මගේ වෙන්නේතනි වූ වෙලාවක ඔබ මගේ ලග ඉන්න මා හැරදා නොයා...පපුවේ තියා හිස ඉල්ලුවොත් හිත දෙනව මං නොමිලෙම ලියා...සදවත අහසින් වැටිලා......",
    "metaphor": "සදවත",
    "meaning": "A face that is very beautiful or radiant, as if it were the moon falling from the sky",
    "source": "Face",
    "target": "Moon"
  },
  {
    "title": "Sandawathiya Obai",
    "artist": "Roshan Fernando",
    "album": "Sandawathiya Obai",
    "releasedYear": "2010",
    "lyricist": "Roshan Fernando",
    "lyrics": "සඳවතිය ඔබයි....මුදු සුවය ඔබයි....මගෙ ජීවිතේ.....මගෙ ජීවිතේ....අපි අපේ වෙමු සදා...හිරු කුමරු ඔබයි...මට දිරිය ඔබයි...මගෙ ජීවිතේ...මගෙ ජීවිතේ...අපි අපේ වෙමු සදා...මේ භවයේ.....ඔබ මා සොයලා..ලංවූවා.....සෙනෙහේ පුදලා..කතරක වැහිදිය පොදක්වගේහමුවූවා......ඔබ හමුවූවා..සඳවතිය ඔබයි....මට දිරිය ඔබයි...මගෙ ජීවිතේ...මගෙ ජීවිතේ...අපි අපේ වෙමු සදා...ඔබහා මා.......සතුටින් හිදිමූ...දිවි ගමනේ....අපි එකට යමූ...සමුගන්නාදා ලෝකයෙන්එකට යමූ.....අපි එකට යමූ.....සඳවතිය ඔබයි....මුදු සුවය ඔබයි....මගෙ ජීවිතේ.....මගෙ ජීවිතේ....අපි අපේ වෙමු සදා...හිරු කුමරු ඔබයි...මට දිරිය ඔබයි...මගෙ ජීවිතේ...මගෙ ජීවිතේ...අපි අපේ වෙමු සදා...අපි අපේ වෙමු සදා...",
    "metaphor": "සඳවතිය",
    "meaning": "Having a strong influence on the speaker's life and actions, or that they are an integral part of the speaker's life",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Sandawathiye ",
    "artist": "Ashan Fernando",
    "album": null,
    "releasedYear": "2018",
    "lyricist": "Nisal Fernando",
    "lyrics": "සඳ රූරා හීන සේයානෙතු පායා මායාව විහිදානිදි වරනා පාළු හෝරාමට නුඹ හා විඳගන්න ඕනාසඳ දිය දහරා හදවත පාරාමගේ සඳ කිඳුරී මා ගාව පායාසිතුවිලි පීරා ලය පිරිමදිනාදිගු නිල් දෑසේ මායාවේ ගිලුණාසඳ වතියේ...සඳ වතියේ...පායා තරු කැට වීණාහීනේ සියොළඟ රැඳුනාඝණ අඳුරේ මා හා පිය මනිනාඅරුමොසම් දෑසට වහ වැටුණාසෙවනැලි මාවතේ සැඟවෙන්නෙපාකවිකාර පෙම දෝරෙ ගැලුවාසඳ වතියේ නුඹගේ සෙනෙහේ සුසුම් ඇහැරුණාරහසේ කාලය ගෙවනාමායා සිහිනයේ රැඳිලාසඳ සෙවනේ නුඹ හා නෙතු පටලාආදරයේ මීවිත අයදිනවාසෙවනැලි මාවතේ සැඟවෙන්නෙපාකවිකාර පෙම දෝරෙ ගැලුවාසඳවතියේ නුඹගේ සෙනෙහේ සුසුම් ඇහැරුණාසඳ රූරා හීන සේයානෙතු පායා මායාව විහිදානිදි වරනා පාළු හෝරාමට නුඹ හා විඳගන්න ඕනාසඳ දිය දහරා හදවත පාරාමගේ සඳ කිඳුරී මා ගාව පායාසිතුවිලි පීරා ලය පිරිමදිනාදිගු නිල් දෑසේ මායාවෙ ගිලුණාසඳ වතියේ...සඳ වතියේ...සඳ වතියේ...සඳ වතියේ...",
    "metaphor": "සඳ වතියේ",
    "meaning": "Girl who is bright as the moon",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Oba Gawa Mama Innemi",
    "artist": "Sahan Chamikara",
    "album": "Oba Gawa Mama Innemi",
    "releasedYear": "2016",
    "lyricist": "Rookantha Gunathilaka",
    "lyrics": "ඔබ ගාව මම ඉන්නෙමිසුසුමන් වගේ යාවෙවීතනියේ තුරුල් වී මුමුණා සුපෙම් ගීරෑ සීතලේ ළං වෙවීතරුමල් කඩා දෙන්නෙමි //මිණිසේ දිළෙන්නේ තරු සේ නිවෙන්නේඔබගේ සිනා දෑස නේදෝනොසැලී තියෙන්නේ සසැලී නොයන්නේඔබගේ මගේ ස්නේහෙ නේදෝසිත මාගෙ සනසන්නේ සරසන්නේ ඔබමයි ළඳේවෙන කවුරුවත් මාගේ තුරුළේ නිදන් නෑ ළඳේමතු ජීවිතේ දී මෙලොවින් තුරන් වීගුවනේ පියාඹන්න වේවිඅභ්‍යාවකාශේ ග්‍රහලෝක ගානේමිතුරන් සොයා යන්න වේවිඒ කාලෙදිත් මා පතන්නේ ඔයාවයි ළඳේදෙව් දූවරුන්ගෙන් අහන්නෙත් ඔයාවයි ළඳේඔබ ගාව මම ඉන්නෙමිසුසුමන් වගේ යාවෙවීතනියේ තුරුල් වී මුමුණා සුපෙම් ගීරෑ සීතලේ ළං වෙවීතරුමල් කඩා දෙන්නෙමි //",
    "metaphor": "තරුමල්",
    "meaning": "Something that is beautiful, radiant, or shining",
    "source": "Flower",
    "target": "Star"
  },
  {
    "title": "Wedi Warusa",
    "artist": "Sandun Perera",
    "album": "Wedi Warusa",
    "releasedYear": "2019",
    "lyricist": "Sajith V Chathuranga",
    "lyrics": "දිනෙක වරදින්නම ඕනේ..දැනගන්න මිනිසුන් ලෝකේ..කවුද හැබැහින් නැති දා මෙන්..ආදරේ කියා..ඔබට මා හොද මදි වූයේආස කරනා වටින දේ..ගෙන දෙන්න ඉල්ලන වේගෙන්මට බැරි නිසා..වෙඩි වරුසා ඇද හැලුනත්මිය නොවෙන ප්‍රේමෙට මගේ..බොරු කරලා කවදාවත්සැනසෙන්න බෑ අන්තිමේ..//මාගෙ දිවියේ කිසිම දිනයේ..නොකල දේවල් හුඟක් කෙරුවේ..ඔබ තබන්නයි මලක් වාගේ..සුවඳ හමමින් රෑ දිවා..කඳුලු හෙලලා හැමට වචනෙන්නොකීවත් මා හඬ නගා..ඔබව නොබලා ගෙවන මොහොතත්කල්පයක් මෙන් දැනෙනවා..වෙඩි වරුසා ඇද හැලුනත්...විඩාබර වී අලුත් හෙවනේඔබට මතු යම් දිනෙක ආයේ..හොඳට තේරෙයි අඩුව මාගේඅපේ පුරාණේ සිහිවෙලා..කඳුලු හෙලලා හැමට වචනෙන්නොකීවත් මා හඬ නගා..ඔබව නොබලා ගෙවන මොහොතත්කල්පයක් මෙන් දැනෙනවා..වෙඩි වරුසා ඇද හැලුනත්...",
    "metaphor": "වෙඩි වරුසා",
    "meaning": "Strong and resilient love for someone, and that it can withstand any challenges or obstacles that may come their way",
    "source": "Rain",
    "target": "Bullet"
  },
  {
    "title": "Mal Warusawai",
    "artist": "Ravi Jay",
    "album": "Wedi Warusa",
    "releasedYear": "2022",
    "lyricist": "Thilina Boralessa",
    "lyrics": "මල් වරුසාවයි ..සීතයියන්නට අපි දෙන්නාමට ලොබයිඅයේ හමු නොවෙනාඑ මොහොතත් නතර උනාසඳ එලියෙන් නැහැඋනා ආදරය දී ඉන්නෙපා සුසුමකට ඉඩතියා..සයනයේ මත රිදුම් වැලපුමහවසකට හරිආයේ එනවදබෑ ඉන්නට අද තව ඉර මුදුන්වෙලා හොදටමඔය මල ඉඹගෙන මගෙ රත්වුනු කඩුව තියන්නටනුඹෙ සියුම් ගතෙ මේ අශෝක චන්ඩාශෝකයන් වෙන්නං අදමේඝ වලාවන් අරගෙන නුඹ එනවද සංග්‍රාමෙට...ඩිංගක් නපුරෙක් වෙන්නට මට අද පොඩ්ඩක් ඉඩ දෙන්නඉකිබිද නොඅඩන්  පොඩ්ඩක් රිදවන්නෙ උච්චම ස්වරෙ නුඹෙ මට ගන්න...කුෂාන්තියේ දුමේ මතින් වෙරලු මල් සුවදත් රගදෙයි රාගෙආලෝකෙ දුරයි අදුරයි යහනේගැලවෙන්න හිතක් නෑ මේ ශාපෙන්...ඉතිං අපි දුර යං පාවී මේ දෑස බලා මරවන් රාගීදැං හදිස්සියක් නැතුවත් වේවිගිනි ගන්න මේ කරුමෙට ඇයි ආවේ මං ඇයි ආවේමේ බොදඋනු හීනෙකට ලෝබෙකටමේඝවලා අරගෙන වැස්සත් අරගෙනඩිංගක් සැනසෙන්න හවසට එනවාද?හිත සැනසුවාගත වෙහෙසවාඅපි සැනසුනේකරැමේ අපේ... කරුමේසයනයේ මැද - මං දෑසින් දැක්කාරිදුම් හදවත - මනසින් වින්දාහවසකට හරිආයෙ එනවද? -මේ රාගේ පල්ලා",
    "metaphor": "මල් වරුසාවයි",
    "meaning": "Feeling of being surrounded or enveloped by something positive or uplifting",
    "source": "Rain",
    "target": "Flower"
  },
  {
    "title": "Mal Warusawe",
    "artist": "Kasun Kalhara",
    "album": null,
    "releasedYear": "2007",
    "lyricist": "Romain Mendis",
    "lyrics": "මල් වරුසාවේ පාවී එන්නම්රෑ අදුරේ…තරු කැට අතරින්ඔබ එනවානම් – රැදෙන්නම් සිතේසීත රැයේ තනිකම නොදැනේ…නිල් ආකාසේ…පාවී එන්නම්…පාවී එන්නම්…..පිණි දිය විසිරුනු ගං ඉවුරේදිය රල බිදුනේ ගී හඩ සේ..ඔබ මා වූ සිහින පැලේසෙනෙහේ දැනුනේ…මල් වරුසාවේ…පාවී එන්නම්පාවී එන්නම්…..මල් වරුසාවේ පාවී එන්නම්රෑ අදුරේ තරු කැට අතරින්ඔබ එනවානම් රැදෙන්නම් සිතේසීත රැයේ තනිකම නොදැනේනිල් ආකාසේ…පාවී එන්නම්…පාවී එන්නම්…",
    "metaphor": "මල් වරුසාවේ",
    "meaning": "surrounded or enveloped by something beautiful or positive. Used to express the speaker's desire to experience joy, happiness, or other positive emotions",
    "source": "Rain",
    "target": "Flower"
  },
  {
    "title": "Soya Awa",
    "artist": "Ridma Weerawardena",
    "album": "Dura Akahe Master Collection by Charitha Attalage",
    "releasedYear": "2020",
    "lyricist": "Chandrasena Thalangama",
    "lyrics": "සදා කාලේ මා…හදේ වීනා…මවා පෑ සිනා…මගේ හීනේ මා…සොයා ආවා…පැතූ සේ එදා…කොයිද උපමා…ලොවේ කිසිදාඅසා නෑ මා…හදේ ඇදුනා…හිතේ රැදුනා…ඔබේ රූ අමා…මගේ ගීතේ මා…එදා කීවා…හදේ පෑරෙනා…ඔබේ දෑ සේ ගී පොතේ වූ වාමගේ චේතනා…ඇයි ද ගොලු වී…බලා නොබලා…සිනා පානා…සොයා ආවා…සොයා ආවා…එදා මෙන් මා…දෑසේ  ලා සද රේකා…සිසිලේ නෑ වේවා…මුහුනේ ගෑ ආලේ…සොදුරේ මා වේවා…ඉතිරේවා…සැමදා සෙනේ…මා පැතුවා හදින්…සමාවී අසන්…අදුරේ මා නොහෙලා ඉතින්…සිනා පා ඉදින් සදා මා ලගින්…මගේ ගීතේ මා…එදා කීවා…හදේ පෑරෙනා…ඔබේ දෑ සේ ගී පොතේ වූ වාමගේ චේතනා…ඇයි ද ගොලු වී…බලා නොබලා…සිනා පානා…සොයා ආවා…සොයා ආවා…එදා මෙන් මා…",
    "metaphor": "හදේ වීනා මවා පෑ සිනා",
    "meaning": "Someone who is emotionally sensitive and happy",
    "source": "Heartbeat",
    "target": "Violin"
  },
  {
    "title": "Pandama",
    "artist": "Dhanith Sri",
    "album": "Pandama",
    "releasedYear": "2018",
    "lyricist": "Dhanith Sri",
    "lyrics": "පන්දම රැගෙන යන්න එන්න මා හදවතටනෙතු දැහැන් බිඳිනා රන් සලුව ඇඳලියතඹර ලෙලවා හද මඬල යටදෙන්න මැණිකෙ මගෙ පපුවට ගින්දරමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතීරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේහදවත පතුලේ යකු බෙර වැයුනේතම්දෙන තානේනේ නාඅනේ මගේ යකුනේ නටපන් හනිකේතම්දෙන තානේනේ තානේනේ තානානේතම්දෙන තානේනේ නාඉණ වට බැන්දා වූ මුතු පොට සැලෙනකොටපන්දම දැවෙනවා හද ගිනි ලවාගෙනවැහි කළුව එනවා නුඹ නැති දාටසිත් අහසම පුරවා අන්ධකාරෙකමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතීරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේමේ දුර දිවි කතරේ අතරමඟදි දැකලා නැතීරුවකට නෙත ගැටුනේ කතරක වැසි වැටෙනා දැනේහදවත පතුලේ යකු බෙර වැයුනේතම්දෙන තානේනේ නාඅනේ මගේ යකුනේ නටපන් හනිකේතම්දෙන තානේනේ තානේනේ තානානේ",
    "metaphor": "පන්දම රැගෙන යන්න එන්න මා හදවතට",
    "meaning": "Feel intense feelings of love or desire",
    "source": "Love",
    "target": "Fire"
  },
  {
    "title": "Wasantha Kaleta",
    "artist": "Roshan Fernando",
    "album": "Wasantha Kaleta",
    "releasedYear": "2012",
    "lyricist": "Roshan Fernando",
    "lyrics": "වසන්ත කාලෙට සුරංගනාවන් අනන්තවත් ඒවීඑපා කියද්දී බලහත්කාරෙන්‍ යහනට කඩාවදීවිනීත තාලෙන් ප්‍රේමාලිංගනනෙත් කරලිය පාවීබැහැයි කියද්දි සුරතින්ඇදගෙනතුරුලේ රඟපාවීබැහැයි කියද්දි සුරතින්ඇදගෙනතුරුලේ රඟපාවීමේ පැහැදිලි සඳපානේදඟලන තරු ලැජ්ජාවේමැවෙනා සිහින ඟඟේදීඑළිවෙනවා නොදැනේමේ පැහැදිලි සඳපානේදඟලන තරු ලැජ්ජාවේමැවෙනා සිහින ඟඟේදීඑළිවෙනවා නොදැනේ---------------වසන්ත කාලෙට සුරංගනාවන්අනන්තවත් ඒවීබැහැයි කියද්දී ඇවිටිලි කරමින්සෙනෙහස ඉල්ලවීප්‍රනීත් මදිරා පෙරා පුරාදීඋමතු වෙසින් කැරකීබැහැයි කියද්දීසවුදිය පිරුමට යෞවනයම අයදීබැහැයි කියද්දීසවුදිය පිරුමට යෞවනයම අයදීමේ පැහැදිලි සඳපානේදඟලන තරු ලැජ්ජාවේමැවෙනා සිහින ඟඟේදීඑළිවෙනවා නොදැනේමේ පැහැදිලි සඳපානේදඟලන තරු ලැජ්ජාවේමැවෙනා සිහින ඟඟේදීඑළිවෙනවා නොදැනේ",
    "metaphor": "වසන්ත කාලෙට සුරංගනාවන් අනන්තවත් ඒවී",
    "meaning": "Beautiful girls come to you only when you are successful",
    "source": "Success",
    "target": "Spring"
  },
  {
    "title": "Api Kawruda",
    "artist": "Senaka Batagoda",
    "album": "Api Kawruda",
    "releasedYear": "2010",
    "lyricist": "Senaka Batagoda",
    "lyrics": "සී සීකඩ විසිරුනු හිතුවිලිදියබුබුලේ නලියන පෙනකැටි වාගේ, නැතිවේහුදකලාවෙ තනිවී හිටියමසිහින ආකරේක වැටුනා වාගේ, නිමක් නෑමෙහොතින් මොහොතට ගෙවනා කාලයදැනෙවා කාටත් එක විදිහටගිනියම් ඉර, සඳ සිසිලසඅතරේ හොයනවා හොයනවා, මේ අපි කවුරුද?ගීයකි ලොව, සිතුවම් කලඅතරේ අහනවා බලනවා, මේ අපි කවුරුද?ඉර බැසයන ගොම්මන් යාමේතරු එක එක දිලිසෙන කළු ආකාසේ (ඔව්, ඔව්, ඔව්)ගලා ඇදෙන රිද්මේ නැහැවිඇදී යන්නෙ ඈතින් ඈතට පාවි, සුළඟ සේමෙහොතින් මොහොතට ගෙවනා කාලයදැනෙවා කාටත් එක විදිහටගිනියම් ඉර, සඳ සිසිලසඅතරේ හොයනවා හොයනවා, මේ අපි කවුරුද?ගීයකි ලොව, සිතුවම් කලඅතරේ අහනවා බලනවා, මේ අපි කවුරුද?ගිනියම් ඉර, සඳ සිසිලසඅතරේ හොයනවා හොයනවා, මේ අපි කවුරුද?ගීයකි ලොව, සිතුවම් කලඅතරේ අහනවා බලනවා, මේ අපි කවුරුද?",
    "metaphor": "ගීයකි ලොව",
    "meaning": "World is a harmonious or meaningful place",
    "source": "World",
    "target": "Song"
  },
  {
    "title": "Heena Walata Panak",
    "artist": "Senaka Batagoda",
    "album": "Heena Walata Panak",
    "releasedYear": "2017",
    "lyricist": "Senaka Batagoda",
    "lyrics": "හැමදේම ටිකෙන් ටිකවෙනස් වෙලා වසන්තයටඅලුත් අලුත් හීන මැවෙනවාමග බලා සිටිය දේවල්මතු වෙලා ළඟට එන්නටහීන වලට පණක් තියෙනවාගෙවිලා ගිය දේවල්ඉදිරියෙ වෙන දේවල්වෙනසක් නැහැ සිදු වේආගිය මග යා යුතු තැනදන්නෙ තමා ම යිනිදහසේ නිමක් නැතිවසිතුවිලි ගඟ ගලා යද්දිපෙර නුදුටුව හීන මැවෙනවාසුල මුල හෑම දේමහිත් වල තෙරපුණාමයා යුතු ගමනෙ දුර දුරයිකරනා දේවල් හරියට වේ නම්වසන්තය එයයිහැමදේම ටිකෙන් ටිකටවෙනස් වෙලා වසන්තයටඅලුත් අලුත් හීන මැවෙනවාමග බලා සිටිය දේවල්මතු වෙලා ළඟට එන්නටහීන වලට පණක් තියෙනවාහීන වලට පණක් තියෙනවා ",
    "metaphor": "හීන වලට පණක් තියෙනවා",
    "meaning": "Dreams are something that is real, meaningful, or significant, and that they are capable of having an impact on one's life",
    "source": "Dreams",
    "target": "Life"
  },
  {
    "title": "Ananthayata Yanawamai",
    "artist": "Senaka Batagoda",
    "album": null,
    "releasedYear": "2012",
    "lyricist": "Senaka Batagoda",
    "lyrics": "සිහින මවන්නැති අහස උසට තනියමළං වෙන්න වෙන්න ඇයි සමහර දුරඇහෙන දකින දේවල් කොතරම් තිබුණදහදට දැනෙන දේවල් ඇයි එතරම් බරසිරවෙලා නැවතිලා නැතිනම් සීමාවකනිදහසේ ඉගිලිලා යමු එක රෑනකහො හෝ හෝ... හො හෝ හෝ...හො හො හො...සෑම දෙයම නිම විය හැක නිමේෂයකඑහෙම වුනෝතින් මොනව හිතන්නදසිහින විමන් වල කවුළු පියන් හැරුනමඅනන්තයට යනවාමයි ඒ මොහොතෙමසිරවෙලා නැවතිලා නැතිනම් සීමාවකනිදහසේ ඉගිලිලා යමු එක රෑනකහො හෝ හෝ... හො හෝ හෝ...හො හො හො...සිරවෙලා නැවතිලා නැතිනම් සීමාවකනිදහසේ ඉගිලිලා යමු එක රෑනකහො හෝ හෝ... හො හෝ හෝ...හො හො හො...",
    "metaphor": "සිහින විමන්",
    "meaning": "Place where one can find happiness or fulfillment",
    "source": "Dreams",
    "target": "Palace"
  },
  {
    "title": "Sanda Mithuri",
    "artist": "Kasun Kalhara",
    "album": "Sanda Mithuri",
    "releasedYear": "2012",
    "lyricist": "Achala Solomons",
    "lyrics": "ඉගිලෙන්න ඔබ එක්ක ආකාසේවිදගන්න ඒ සිසිල මා සිත්සේමට දෙන්න ඒ වරමකවදාද ඔබ එන්නෙපිනි බින්දු මල් වැහි අරන්සද මිතුරිසිත මිහිරිකල මැනවිබිදු කදුලුපිනි පොකුරුකල මැනවිමට මම ම වී ඉන්නලෝකෙන් ඉදක් නොදෙනඈතට වෙලා අපිම අපි වී ඉතින්නව ලොවටමුල් අනු දෙන්නමිල නොවන පෙම් කවිය පබඳින්නපිනි වැස්ස වස්සන්නමද්දහන තෙත් වෙන්නආදරය දලු ලන්නමිහිකත මතින්සිහිනෙ සනහාකිරණින් දැවෙනාඉගිලෙන්න ඔබ එක්ක ආකාසේවිදගන්න ඒ සිසිල මා සිත්සේමට දෙන්න ඒ වරමකවදාද ඔබ එන්නෙපිනි බින්දු මල් වැහි අරන්සද මිතුරිසිත මිහිරිකල මැනවිබිදු කදුලුපිනි පොකුරුකල මැනවිජීවිතය විදගන්නලෝකෙන් ඉඩක් නොදෙනඈතට වෙලා තෙමෙමුපිනි වැහි පොදින්ප්රේමයට ප්රේමය වෙන්නනිල නොවන ජිවිතය පුබුදන්නපිනි වැස්ස වස්සන්නමද්දහන තෙත් වෙන්නආදරය දලුලන්නමිහිකත මතින්සිහිනේ සනහාකිරණින් දැවෙනාඉගිලෙන්න ඔබ එක්ක ආකාසේවිදගන්න ඒ සිසිල මා සිත්සේමට දෙන්න ඒ වරමකවදාද ඔබ එන්නෙපිනි බින්දු මල් වැහි අරන්සද මිතුරිසිත මිහිරිකල මැනවිබිදු කදුලුපිනි පොකුරුකල මැනවිඉගිලෙන්න ඔබ එක්ක ආකාසේවිදගන්න ඒ සිසිල මා සිත්සේමට දෙන්න ඒ වරමකවදාද ඔබ එන්නෙපිනි බින්දු මල් වැහි අරන්සද මිතුරිසිත මිහිරිකල මැනවිබිදු කදුලුපිනි පොකුරුකල මැනවි",
    "metaphor": "සද මිතුරි",
    "meaning": "A girl who is very attractive or captivating, and who has a peaceful or serene demeanor",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Alu Yata Gini",
    "artist": "Senaka Batagoda",
    "album": "Alu Yata Gini",
    "releasedYear": "2010",
    "lyricist": "Senaka Batagoda",
    "lyrics": "පුපුරන්නට යන කන්දක් ලගසුවසේ ඉන්නට බෑඅවදානම කොයි මොහොතෙද!ජීවිතයම සීමා කොටු තුලසිරවී සිටියාද හිතෙනවා බැලුවමපසුගිය කාලයවෙනසක් විය යුතුමයි ජීවිතයටකවදද කොහොමද නොදනී හරියටඅළු යට ගිනි වැනි හිතුවිලිඅපිව වසාගෙන කොහෙදො ඈතක යනවා...සීතල කදු වැටියෙන් ඔබේනිල්ල පිරුණු මිටියාවතතොතැන්නකි හැමදෙටම ...ජීවිතයට අගයක් වන වේනම්සිතුවිලි වල සුවඳ දැනෙනම් තව,වෙන මොනවද?වෙනසක් විය යුතුමයි ජීවිතයටකවදද කොහොමද නොදනී හරියටඅළු යට ගිනි වැනි හිතුවිලිඅපිව වසාගෙන කොහෙදො ඈතක යනවා...අළු යට ගිනි වැනි හිතුවිලිඅපිව වසාගෙන කොහෙදො ඈතක යනවා...අළු යට ගිනි",
    "metaphor": "අළු යට ගිනි වැනි හිතුවිලි",
    "meaning": "Deep or powerful emotions that are not immediately visible",
    "source": "Thought",
    "target": "Fire below ashes"
  },
  {
    "title": "Saragaye",
    "artist": "Sanuka Wickramasinghe",
    "album": "Saragaye",
    "releasedYear": "2016",
    "lyricist": "Sanuka Wickramasinghe",
    "lyrics": "නිය රටාමවනවාඅප'තරේ වූ කතාරැය පුරාඋණුහුමේ මල් පෙති තලාසයනයත්නිදනවාමේ රැය අපගේ වූ නිසාආදරෙන්නග්න වූ හිමිකම් සොයාඋණුසුම් උදයක සුවඳින් ගත පිබිදී ගියාඔබේ නම සොයනව තාමත් නිය සිතුවම් පුරාසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනාකාමරේමුළු පුරානෙක සළු පිළි තනිවෙලාමා සිතින්හඬනවා දෙස බල බලාමංමුලාවූ සිතින්මා මල් සුවඳක් විඳිනවානැති ඉමක්ඇති රුවක් හා මා වෙලීඋණුසුම් උදයක සුවඳින් ගත පිබිදී ගියාඔබේ නම සොයනව තාමත් නිය සිතුවම් පුරාසරාගයේරැයේපිණිබිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනාසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන්තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනා",
    "metaphor": "සඳ ඇතිරිල්ලෙන්",
    "meaning": "Something that has a calming or restful effect, or that provides comfort or security",
    "source": "Blanket",
    "target": "Moon"
  },
  {
    "title": "Oba Apple Malak Wage",
    "artist": "Amarasiri Peiris",
    "album": "Amarasiri Peiris Songs",
    "releasedYear": "2021",
    "lyricist": "Kelum Srimal",
    "lyrics": "ඔබ ඇපල් මලක් වාගේලස්සන වසන්ත කාලේමට හදිස්සියෙන් වාගේ හමු වූපායන්න දෑස මානේඋනුහුමට ගින්දරීගෙනියන්න මාගෙ ගානේ මේ හිතම සුන්දරීදිගු දෑසෙ බැල්ම ඔබගේඇයි සොදුරු ඔය හැටීඔබ ඇපල් මලක් වාගේලස්සන වසන්ත කාලේමට හදිස්සියෙන් වාගේ හමු වූඇස් පියෙන් අදී කෑලි කැපෙන රලු රාත්රියේකීරි ගැහෙන සිත අනුහස අයදී ප්රේමයේඑය පමනක් ශේශය වී නම් පූර්වාත්මයේඔබ ගැවසෙන මා හිත අවිනීතයිඅවනත නැති නෙතටද අවිවේකයිහුදෙකලාව අවනඩුවක්... ගෑනු ළමයෝඔබ ඇපල් මලක් වාගේලස්සන වසන්ත කාලේමට හදිස්සියෙන් වාගේ හමු වූඉටි රූපෙ අපූරුව විදින්න මන් හරි ආසයිපින්තූරෙ වගේ ඔබ හිනැහෙනකොට මට ලෝබයිඅහිතක් හිතන්නෙ නැති නම් මන් හරි ආදරෙයිකියාගන්න බැරි කමින් හිත බරයිඊයේ අද මෙන් හෙටත් එහෙම වෙයිහුදෙකලාව අවනඩුවක්... ගෑනු ළමයෝඔබ ඇපල් මලක් වාගේලස්සන වසන්ත කාලේමට හදිස්සියෙන් වාගේ හමු වූපායන්න දෑස මානේඋනුහුමට ගින්දරීගෙනියන්න මාගෙ ගානේ මේ හිතම සුන්දරීදිගු දෑසෙ බැල්ම ඔබගේඇයි සොදුරු ඔය හැටීඔබ ඇපල් මලක් වාගේලස්සන වසන්ත කාලේමට හදිස්සියෙන් වාගේ හමු වූ",
    "metaphor": "ඔබ ඇපල් මලක්",
    "meaning": "Someone who is attractive or captivating, and who has a refined, gentle nature, bright, colorful, or full of life",
    "source": "Person",
    "target": "Apple flower"
  },
  {
    "title": "Ran Kurahan Mala",
    "artist": "Bathiya and Santhush",
    "album": "Best of Bathiya & Santhush - Hit Singles",
    "releasedYear": "2013",
    "lyricist": "Wasantha Dukgannarala",
    "lyrics": "නානානේ නානනෙ නානානානානේ නානනෙ නානානාතම්දෙ නාතම්දේ නානානාතම්දෙ නාතම්දේ නානාරන් කුරහන් මල සේමාසුපිපුණු ඔබේ වත බෝමාදැක්ක ගමන් සිත සැලෙනාප්රේමී නුඹේ අත ඕනාදැක්ක ගමන් සිත සැලෙනාප්රේමී නුඹේ අත ඕනාමල් මසුරන් ගී ඇසෙනාගම්මානේ මා මන බඳිනානානානේ නානනෙ නානානානානේ නානනෙ නානානාතම්දෙ නාතම්දේ නානානාතම්දෙ නාතම්දේ නානාසෘංගාරේ උතුරන බෝමානෙරිය අඟින් ඉඟ පෙන්නාපාන සිනාවෙන් පේනානිල්මිණි කැලුමන් සේමාපාන සිනාවෙන් පේනානිල්මිණි කැලුමන් සේමාහිරිමල් හිත හිරිවැටුණාකුළුදුල් සිත කිතිකැවුණානානානේ නානනෙ නානානානානේ නානනෙ නානානාතම්දෙ නාතම්දේ නානානාතම්දෙ නාතම්දේ නානානානානේ නානනෙ නානානානානේ නානනෙ නානානාතම්දෙ නාතම්දේ නානානාතම්දෙ නාතම්දේ නානා",
    "metaphor": "සුපිපුණු ඔබේ වත",
    "meaning": "Someone's face has become very beautiful or radiant, as if it were a flower that has blossomed",
    "source": "Face",
    "target": "Flower"
  },
  {
    "title": "Kiri Kodu",
    "artist": "Bathiya and Santhush",
    "album": "Neththara",
    "releasedYear": "2005",
    "lyricist": "Nilar N. Cassim",
    "lyrics": "කිරි කෝඩු හිතට ආල නුඹේ දෑස යාවුනාමගේ කෝල කමට ලෝල හැඟුම නුඹට පේවුණාසබදේ සුවඳේ කුළුඳුල් ආදරේඋතුරා ගැලුවේ අම මී ජීවිතේකිරි කෝඩු හිතට ආල නුඹේ දෑස යාවුනාමගේ කෝල කමට ලෝල හැඟුම නුඹට පේවුණාසුපෙම් නුවන් විමසාවි රෑ දිවාඔබ රූ අඳුන් දසුනින් දුරයි කියාඔය පෙම් තෙපුල් මදහාස පෑ නියාළය ගිම් නිවු සිහිලාර වෑහුනාමතු මා පැතු කිසිවක් නොවේසැනසීම වේ ආදරේHaahahahaha hahahahaaa haahahaahahaHaahahahaha hahahahaaa haahahaahahaමතු මා පැතු කිසිවක් නොවේසැනසීම වේ ආදරේසිතුම් පැතුම් ඉටුවේවි වාසනාඅඳුරෙන් මිදී සඳ ඒවි පායලාඔබ මේ පිදු සෙවනේම ඈදිලාමගේ ජීවිතේ නවතීවි පා සිනාමෙතුවක් ලැබූ කිසිවක් නොවේසැනසීම වේ ආදරේකිරි කෝඩු හිතට ආල නුඹේ දෑස යාවුනාමගේ කෝල කමට ලෝල හැඟුම නුඹට පේවුණාසබදේ සුවඳේ කුළුඳුල් ආදරේඋතුර ගැලුවේ අම මී ජීවිතේකිරි කෝඩු හිතට ආල නුඹේ දෑස යාවුනාමගේ කෝලා කමට ලෝල හැඟුම නුඹට පේවුණා",
    "metaphor": "පෙම් තෙපුල්",
    "meaning": "Someone who is very affectionate or loving",
    "source": "Lips",
    "target": "Love"
  },
  {
    "title": "Chandani Payala",
    "artist": "Bathiya and Santhush",
    "album": "Neththara",
    "releasedYear": "2005",
    "lyricist": "Nilar N. Cassim",
    "lyrics": "චාන්දනී පායලාසීත සැලුවා මේ රාත්රියේජීවිතේ අවපසයිමං තවම සීතල කළුවරේමේ කුළු මතින් ඇදීඔබ එන්න මා කෙරේඔබ වේද මතුදාකමා ලබන රම්බරීචාන්දනී පායලාසීත සැලුවා මේ රාත්රියේජීවිතේ හිස්කමින්තුන් යාමයේහිත් පෑරුනේ සත්තකින් ඔබයහද රැන්දු සුරඹුන්ඒ හැඟුම් කොයි ලෙසින් සිත්සේපවසම්ද සොඳුරේපෙම් හැඟුම් මතකයේ රංචු ගැහුනායටි හිතේ පොපියමින් හීන මැවුනාපෙම් හැඟුම් මතකයේ රංචු ගැහුනායටි හිතේ පොපියමින් හීන මැවුනාසන්සුන් සුසුම් ද කැළඹිඇයිද මොකදැයි ඇහුවාරාගයේ චන්ද්ර හැඟුමන්රණ්ඩු කෙරුවාමං කෙසේ කොයි ලෙසේ මුමුණමේ ශෝක ගීතේකවුරුවත් දන්නෙ නෑ දැන් මේමං ඉන්නෙ හිරගේචාන්දනී පායලාසීත සැලුවා මේ රාත්රියේජීවිතේ අවපසයිමං තවම සීතල කළුවරේමේ කුළු මතින් ඇදීඔබ එන්න මා කෙරේඔබ වේද මතුදාකමා ලබන රම්බරීයන්තමින් නුවනඟින් කඳුළු එබිලාදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවායන්තමින් නුවනඟින් කඳුළු එබිලාදෙකොපුලෙන් හෙමි හෙමින් සීත ගැලුවාදිවි ගිම් නිවෙන්න පැතුවේමදුර ස්වරයයි ඔබගේආදරේ හීනයක් නම්හැබෑ නොවෙනාමං කෙසේ දැවි දැවී ඉන්නෙමේ වේදනාවෙන්ඇස් අගින් ඔබ ලියූ කවි ගීමුමුණන්න මුවඟින්ඔය මන්දහාසයෙන්සැනහේවි ජීවිතේසෝතාප සඟවන්නඔබ එන්න ආදරෙන්චාන්දනී පායලාසීත සැලුවා මේ රාත්රියේජීවිතේ අවපසයිමං තවම සීතල කළුවරේමේ කුළු මතින් ඇදීඔබ එන්න මා කෙරේඔබ වේද මතුදාකමා ලබන රම්බරීචාන්දනී පායලාසීත සැලුවා මේ රාත්රියේජීවිතේ හිස්කමින්තුන් යාමයේහිත් පෑරුනේ සත්තකින් ඔබයහද රැන්දු සුරඹුන්ඒ හැඟුම් කොයි ලෙසින් සිත්සේපවසම්ද සොඳුරේ",
    "metaphor": "ආදරේ හීනයක්",
    "meaning": "Love is something that is desirable or aspirational, and that one longs for it or hopes to experience it in their life",
    "source": "Love",
    "target": "Dream"
  },
  {
    "title": "Naukawa",
    "artist": "Dhanith Sri",
    "album": null,
    "releasedYear": "2018",
    "lyricist": "Dhanith Sri",
    "lyrics": "ඇදී යන්නේ මේ දිගන්තේමාරුතේ හැපීමන්දාකිණි හමුවේවිදෝඅහස් ගඟ තරණයේවසන්තේ දුරයිදෝකෙසේ හෝ ලංවේවිදෝඅනන්තේ දකියිදෝනිම් තෙර හමුවන තුරානෞකාවේගමනේනෞකාවේගමනේතරමක උසට වැඩුණු හය හතරක ඇඟකටඋරුම කරුවෙකු නොවන මගෙ පපුවටලොකු පොඩි හැම දෙයක්ම දැනුනාමග බලන බලන තැන හුස්මට දුවගෙනතරුම හොයන් යන මේ දිවි ගමනකකෙළවර එක බව මට දැනුනාවසන්තේ දුරයිදෝකෙසේ හෝ ලංවේවිදෝඅනන්තේ දකියිදෝනිම් තෙර හමුවන තුරානිමා වෙන්නේ මේ ජීවේරිද්මයකට හුරු වූහඹා යන්නේ මායාවේඅතීතයම රැවටූවසන්තේ දුරයිදෝකෙසේ හෝ ලංවේවිදෝඅනන්තේ දකියිදෝනිම් තෙර හමුවන තුරාගමනේනෞකාවේගමනේනෞකාවේගමනේනෞකාවේගමනේඇදී යන්නේ මේ දිගන්තේමාරුතේ හැපී",
    "metaphor": "වසන්තේ දුරයිදෝ",
    "meaning": "Is a good life far away",
    "source": "Success",
    "target": "Spring"
  },
  {
    "title": "Senehas Aware",
    "artist": "Supun Perera",
    "album": null,
    "releasedYear": "2022",
    "lyricist": "Sajith Akmeemana ",
    "lyrics": "රෑ හීන ගානේ නුඹ පෙනේවීහුස්මක් පවා දුර යයි සිතේවීමා ආදරේ නුඹගෙන් දකීවීසංසාරයේ හමුවී තියේවීසෙනෙහස් අවාරේ කුලුදුල් තුෂාරේඔබමයි ගෙනාවේ මගේ දිවිතුරාඅනුහස් විමානේ සිපගත් නුරාවේසදකැන් ගලා ඒ් හදේ ගිම් නිවාමුදු වලා අතරේ පාවෙලා අප සිනා නිතර යාවෙලාදැනෙන්නේ මේ ආදරය දෝවිහගුනේ ගයන ගීතිකා උනුහුමේ විදින චාරිකාඔබ මැවුනේ මා වෙනුවෙන්ම දෝසෙනෙහස් අවාරේ කුලුදුල් තුෂාරේඔබමයි ගෙනාවේ මගේ දිවිතුරාඅනුහස් විමානේ සිපගත් නුරාවේසදකැන් ගලා ඒ් හදේ ගිම් නිවාහදවතේ මියුරු කාරණා නුඹ ගෙනා මතක පාරනාකොදුරන් හදට ආරාධනානුඹ මගේ හිතම සාදනා ආදරේ අකුරු තෝරනාඔබමයි හීන හැබැහින් ගෙනාසෙනෙහස් අවාරේ කුලුදුල් තුෂාරේඔබමයි ගෙනාවේ මගේ දිවිතුරාඅනුහස් විමානේ සිපගත් නුරාවේසදකැන් ගලා ඒ් හදේ ගිම් නිවා",
    "metaphor": "හදේ ගිම් නිවා",
    "meaning": "Reduce emotional pain",
    "source": "Pain",
    "target": "Fire"
  },
  {
    "title": "Naden",
    "artist": "Kanchana Anuradhi",
    "album": null,
    "releasedYear": "2022",
    "lyricist": "Dulan ARX",
    "lyrics": "නෑ නෑ නැවතුන මේ හිත නුඹ ළඟවෙනතක නතර වෙලාමා හා ඉඟි බිඟි පානා නුඹ නෙතදැක හිත ඔකඳ වෙලාහද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නාහැඟුමන් ආ දෙන් යා වෙම් නුඹෙම වෙලාහද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නාහැඟුමන් ආ දෙන් යා වෙම් නුඹෙම වෙලාලා ලලාදෙවඟන ඈරුවකට නවතී මා පෙර නෑනාහෙට නාහන මේ හද නෑසිහියක හිඳවනු බෑ දැක නාරී නාරී නාරීදිනකර ඈමන පිනිබිඳුවකි මා ළඟ ඈසිලුවකි ගිනි දැවෙනා ගත රෑසමවැදි හිඳිනට බෑ මිදි දෑනෙන් දෑනෙන් දෑනෙන් ආයේදේවී ප්රේමී හැඟුමන් පාවේවී හෘදේ ලැගුමන් මාමේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන් මාදේවී ප්රේමී හැඟුමන් පාවේවී හෘදේ ලැගුමන් මාමේ නෙත් මානෙන් නොම යන් මාගෙන් මාගෙන් මාගෙන් මාහද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නාහැඟුමන් ආ දෙන් යා වෙම් නුඹෙම වෙලාලා ලලාහද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නාහැඟුමන් ආ දෙන් යා වෙම් නුඹෙම වෙලාහද නිම් නාදෙන් නාදෙන් නාදෙන් නාදෙන් නාදෙන් මත් වෙන්නාහැඟුමන් ආ දෙන් යා වෙම් නුඹෙම වෙලාදෙවඟන ඈරුවකට නවතී මා පෙර නෑනාහෙට නාහන මේ හද නෑසිහියක හිඳවනු බෑ දැක නාරී නාරී නාරීදිනකර ඈමන පිනිබිඳුවකි මා ළඟ ඈසිලුවකි ගිනි දැවෙනා ගත රෑසමවැදි හිඳිනට බෑ මිදි දෑනෙන් දෑනෙන් දෑනෙන් ආයේ",
    "metaphor": "දෙවඟන ඈ",
    "meaning": "You are an angel",
    "source": "Girl",
    "target": "Angel"
  },
  {
    "title": "Obamai Aloke",
    "artist": "Supun Perera",
    "album": "Obamai Aloke",
    "releasedYear": "2021",
    "lyricist": "Dilmin Perera",
    "lyrics": "මේ ප්රේම ඡායාවේමල් පිපෙන හෝරාවේසිප ගත්ත රෑ යාමේ සොඳුරේ (yea-yea-yea)ඒ සිහින රේඛාවේඉගිලෙන්න සැනසිල්ලේරෝසමල් යහනාවේ සොඳුරේආදරේ සිතේ සාගරේ වගේමට කීව, කීව පෙම් කතන්දරේශෝක ගිම් නිවී ප්රේමියේ මගේතාරුකා වගේ දිලෙයි අහසේඔබමයි ආලෝකේඔබමයි මා සිහිනේඔබමයි මා ජීවේප්රේමියේඔබමයි ආලෝකේඔබමයි මා සිහිනේඔබමයි මා ජීවේප්රේමියේසංසාර සරනාවීප්රේමයේ සනසාවීආදරෙන් මට ළංවීමාගේ කෝල මනමාලීමේ ප්රේම ඡායාවේසිත රැඳුණු මදහාසේඔබේ රුවමයි මට සිහිවෙන්නේඔබේ නෙත් දුටුවාවේහදේ මල් පිපුනාවේප්රේම රැල් නැගුනාවේ හදේආදරේ සිතේ සාගරේ වගේමට කීව, කීව පෙම් කතන්දරේශෝකගිම් නිවී ප්රේමියේ මගේතාරුකා වගේ දිලෙයි අහසේඔබමයි ආලෝකේඔබමයි මා සිහිනේඔබමයි මා ජීවේප්රේමියේඔබමයි ආලෝකේඔබමයි මා සිහිනේඔබමයි මා ජීවේප්රේමියේසංසාර සරනාවීප්රේමයේ සනසාවීආදරෙන් මට ළංවීමාගේ කෝල මනමාලීආදරේ සිතේ සාගරේ වගේමට කීව, කීව පෙම් කතන්දරේශෝක ගිම් නිවී ප්රේමියේ මගේතාරුකා වගේ දිලෙයි අහසේසංසාර සරනාවීප්රේමයෙන් සනසාවීආදරෙන් මට ළංවීමාගේ කෝල මනමාලීසංසාර සරනාවීප්රේමයෙන් සනසාවීආදරෙන් මට ළංවීමාගේ කෝල මනමාලී",
    "metaphor": "ඔබමයි ආලෝකේ",
    "meaning": "You lighten up my life",
    "source": "Girl",
    "target": "Light"
  },
  {
    "title": "Gedara budun thiyala",
    "artist": "Chamara Weerasinghe",
    "album": null,
    "releasedYear": "2012",
    "lyricist": "Visharada Kavi Keerthi Thero",
    "lyrics": "ගෙදර බුදුන් කියලා ඔබේ දෙපා වඳින්නතාත්තේ ඔබ මා ළඟ නෑ මට දැකගන්නපියෙන් පියට දුර යන්නට වාරුව දුන්නඔබේ සෙනෙහස කියලා බෑ ඉවර කරන්නදිවා රැයේ සොයා බැලූ අප ගැන කරුණුඅනාගතය ගැන කියලා දුන් මහා ලකුණුදොළොස් මහේ පහන වගේ දැල් වී නිවුණුඔබ සිහි වී හැඬුවා හිත වාවනු බැරිගෙදර බුදුන් කියලා ඔබේ දෙපා වඳින්නතාත්තේ ඔබ මා ළඟ නෑ මට දැකගන්නපියෙන් පියට දුර යන්නට වාරුව දුන්නඔබේ සෙනෙහස කියලා බෑ ඉවර කරන්නකවා පොවා හදා වඩා දුක සැප විමසූදයාබරව හිස අත ගෑ හිතකින් කුළුණුසොහොන් කොතේ නිදනකුගේ සුවඳේ රැඳුණුඔබ සිහි වී හැඬුවා හිත වාවනු බැරිගෙදර බුදුන් කියලා ඔබේ දෙපා වඳින්නතාත්තේ ඔබ මා ළඟ නෑ මට දැකගන්නපියෙන් පියට දුර යන්නට වාරුව දුන්නඔබේ සෙනෙහස කියලා බෑ ඉවර කරන්න",
    "metaphor": "දොළොස් මහේ පහන වගේ දැල් වී නිවුණු",
    "meaning": "Lost beloved one suddenly",
    "source": "Beloved one",
    "target": "Lamp"
  },
  {
    "title": "Dakune pin athi bima",
    "artist": "Chamara Weerasinghe",
    "album": "Top Sinhala Songs, Vol. 08",
    "releasedYear": "2020",
    "lyricist": "Rohana Weerasinghe",
    "lyrics": "දකුණේ පිං ඇති පින් බිම වැවුරුකන්නලසමාවෙන්න විහාරයේ කඳුළු වැටුනටමොර සූරන වැහි කටු එන කඳු ඉරාගෙනකූඩුව ගං වතුරෙ ගියා පැටව් එක්කමදකුණේ පිං ඇති පින් බිම වැවුරුකන්නලසමාවෙන්න විහාරයේ කඳුළු වැටුනටමොර සූරන වැහි කටු එන කඳු ඉරාගෙනකූඩුව ගං වතුරෙ ගියා පැටව් එක්කමඅප්පච්චි කිය කිය මුළු දවස පුරාමකතා කරපු හඬ ඇසේවි තාම ළඟ ළඟඅනාගතේ මා දුටු සුබ නිමිති සේරමමගෙන් උදුරගෙන ගං දිය ගියා මුහුදටදකුණේ පිං ඇති පින් බිම වැවුරුකන්නලසමාවෙන්න විහාරයේ කඳුළු වැටුනටමොර සූරන වැහි කටු එන කඳු ඉරාගෙනකූඩුව ගං වතුරෙ ගියා පැටව් එක්කමපිහිට වෙලා බේරගන්න මගේ කූඩුවපිං අරගත් දෙවියන්වත් උන්නේ නෑ ළඟසොඳුර සමඟ දරුවන් බිළිගත්තා වගේමමාවත් බිළිගත්තා නම් දුකක් නෑ මටදකුණේ පිං ඇති පින් බිම වැවුරුකන්නලසමාවෙන්න විහාරයේ කඳුළු වැටුනටමොර සූරන වැහි කටු එන කඳු ඉරාගෙනකූඩුව ගං වතුරෙ ගියා පැටව් එක්කමදකුණේ පිං ඇති පින් බිම වැවුරුකන්නලසමාවෙන්න විහාරයේ කඳුළු වැටුනටමොර සූරන වැහි කටු එන කඳු ඉරාගෙනකූඩුව ගං වතුරෙ ගියා පැටව් එක්කම",
    "metaphor": "කූඩුව ගං වතුරෙ ගියා පැටව් එක්කම",
    "meaning": "House was destryoed by the flood",
    "source": "House",
    "target": "Cage"
  },
  {
    "title": "Athin athata",
    "artist": "Chamara Weerasinghe",
    "album": null,
    "releasedYear": "2010",
    "lyricist": "Chamara Weerasinghe",
    "lyrics": "ඈතින් ඈතට ඈතින් ඈතටඈතින් ඈතට ගියා...මා ලඟ තිවු සිත අරන් ගියාසුවඳ වත් මා ලග‍ නොතියාඅමතක කරලන්නම් කියා ගියා..අමතක කරලන්නම් කියා ගියා..ඔය ඇස් අමතක වෙන්න නම්මගේ ඇස් පිය වෙන්න වෙයි...//සීතල වැහි බිංදු සේම කදුළුකඩා හැලෙනවා නිමක් නොවේපොළව ඉහිලුවත් ඒ වැහි බිංදුකදුළු ගලන්නට ඉඩ මදිලුඔය ඇස් අමතක වෙන්න නම්මගේ ඇස් පිය වෙන්න වෙයි...//ජීවිතයේ මඟ ම‍ට හරි නුහුරුඉර බටු තරුවයි මග පෑදූඈතක ගිය තරුවක මා දැවටිපැතුම් පතා වී මග තනිවීඔය ඇස් අමතක වෙන්න නම්මගේ ඇස් පිය වෙන්න වෙයි...//",
    "metaphor": "ඉර බටු තරුවයි මග පෑදූ",
    "meaning": "Pathfiner of life",
    "source": "Pathfiner ",
    "target": "Venus"
  },
  {
    "title": "Anawakiyak kiyannan",
    "artist": "Mihindu Ariyaratne",
    "album": "Scattered Singles ",
    "releasedYear": "2019",
    "lyricist": " Mihindu Ariyaratne",
    "lyrics": "අනාවැකියක් කියනවානම් ආදරේ වෙනුවෙන්සිනා දහසක් පිපෙනවා ඇත මගේ වෙනවානම්අනාවැකියක් කියනවානම් ආදරේ වෙනුවෙන්සිනා දහසක් පිපෙනවා ඇත මගේ වෙනවානම්මලෙහි අවසර ලැබෙන තුරු මල් පෙති නොවිඳි බඹරුන්මලෙහි අවසර ලැබෙන තුරු මල් පෙති නොවිඳි බඹරුන්මම වෙමිය සොඳුරියේමම වෙමිය සොඳුරියේඑනයින් ඔබ පිපේ සුවඳින්සුවඳින්සඳෙහි අවසර ලැබෙන තුරැ සඳ දිය නොවිදි කුමරැන්සඳෙහි අවසර ලැබෙන තුරැ සඳ දිය නොවිදි කුමරැන්මම වෙමිය සොඳුරියේමම වෙමිය සොඳුරියේඑනයින් ඔබ දිලේ සතුටින්සතුටින්අනාවැකියක් කියනවානම් ආදරේ වෙනුවෙන්සිනා දහසක් පිපෙනවා ඇත මගේ වෙනවානම්අනාවැකියක් කියනවානම් ආදරේ වෙනුවෙන්සිනා දහසක් පිපෙනවා ඇත",
    "metaphor": "මලෙහි අවසර ලැබෙන තුරු මල් පෙති නොවිඳි බඹරුන්",
    "meaning": "Waiting for chance to enjoy",
    "source": "Boys",
    "target": "Bees "
  },
  {
    "title": "Bambara wage wisekaraya",
    "artist": "Sangeeth Wijesooriya",
    "album": "Tharu wessa",
    "releasedYear": "2012",
    "lyricist": "Sangeeth Wijesooriya",
    "lyrics": "බඹර වගේ විසේකාරයාමම දෙබර වගේ ගණංකාරයාසමනළය වාගේ මම හැඩකාරයාමී මැස්ස වගේ හරි වැඩකාරයා //කෝකිලයා සින්දු කියනවා වගේරස වෑහෙන සින්දු කියනවාමොණර රජා රඟදෙන විධියට අගේකොතනත් මම රඟදක්වනවාමම කපුට වගේ කපටිකමට නෑ හුරුවන්නේකිරි කොකා වගේ හැම තැනදිම කැපිල පෙණෙන්නේබඹර වගේ විසේකාරයාමම දෙබර වගේ ගණංකාරයාසමනළය වාගේ මම හැඩකාරයාමී මැස්ස වගේ හරි වැඩකාරයාසැළලිහිණිය වගෙ නිහඬව ඉන්නවානියම තැනදි කතා කරනවාඋකුස්ස වගේ දුර තියාම දකිනවාඅනතුරකදි මට තේරෙණවානැහැ ගිරව වගේ නිතරම මම කතා කරන්නේපොර කුකුළ වගේ කොතන ගියත් දිනලයි එන්නේබඹර වගේ විසේකාරයාමම දෙබර වගේ ගණංකාරයාසමනළය වාගේ මම හැඩකාරයාමී මැස්ස වගේ හරි වැඩකාරයා //",
    "metaphor": "බඹර වගේ විසේකාරයා",
    "meaning": "Roudy boy",
    "source": "Boy",
    "target": "Bee"
  },
  {
    "title": "Channa kinnarawi",
    "artist": "Bachi Susan",
    "album": "Channa Kinnaravi",
    "releasedYear": "2019",
    "lyricist": "Pasan Liyanage",
    "lyrics": "ස්වේත මීදුම් ඉරා දෙනෙත් මඟ ඇහිරුජිවිතේ සීත සෘතුවේ ගිරි දුර්ග අතරින්මා එක්ක එනවාද චන්න කින්නරාවිමා එක්ක එනවාද චන්න කින්නරාවිරළු පොළොව මතින් දිලෙනාවිඩාබර දිගු ගමනේමුදු සිනිදු දෙපා රිදෙනාවේදනා සුසුම් අතරේආදරේ ශේෂ වේවිද චන්න කින්නරාවිමා එක්ක එනවාද චන්න කින්නරාවිස්වේත මීදුම් ඉරා දෙනෙත් මඟ ඇහිරුජිවිතේ සීත සෘතුවේ ගිරි දුර්ග අතරින්මා එක්ක එනවාද චන්න කින්නරාවිමා එක්ක එනවාද චන්න කින්නරාවිසඳ නිවීගිය රාත්රියේ තාරකා ගොළුව ඝන අදුරේළය මතින් වැතිරි සොඳුරු හීනයකට ඉඩ දීහිනැහෙන්න පුළුවන්ද චන්න කින්නරාවිහිනැහෙන්න පුළුවන්ද චන්න කින්නරාවිහිනැහෙන්න පුළුවන්ද චන්න කින්නරාවි",
    "metaphor": "තාරකා ගොළුව ඝන අදුරේ",
    "meaning": "No stars in the sky",
    "source": "Blank sky",
    "target": "Deaf man"
  },
  {
    "title": "Hithin yana aya",
    "artist": "Sanka Dineth",
    "album": "Hada Gasama ",
    "releasedYear": "2020",
    "lyricist": "Sanka Dineth",
    "lyrics": "වසන් වන සඳ වලාකුළකටඅඬා වැටුණට තාරකාවක්ආයෙ එන්නේ නෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑවසන් වන සඳ වලාකුළකටඅඬා වැටුණට තාරකාවක්ආයෙ එන්නේ නෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑමවාදී තරු රටා අහසේසිනාසී උන් තරු කිනිත්තෙන්මලානික වූ පුංචි තරුවක්පොළෝ තලයට කඩා වැටුණාසරා සඳකට දරාගන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑනිවී යන තරුවක කතාවේබිඳීගිය මතකයේ සැමරුම්හිතේ ගැඹුරුම තැන තියාගෙනආදරේ ඉකිබිඳුම් ඇසුණාමලානික ඇස් හිනාවෙන්නේ නෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑවසන් වන සඳ වලාකුළකටඅඬා වැටුණට තාරකාවක්ආයෙ එන්නේ නෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑහිතින් යන අය අතින් අල්ලානවත්තන්නට බෑ",
    "metaphor": "වසන් වන සඳ වලාකුළ",
    "meaning": "Leaving loved person by someone",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Saragaye",
    "artist": "Sanuka",
    "album": "Saragaye",
    "releasedYear": "2016",
    "lyricist": "Sanuka",
    "lyrics": "නිය රටාමවනවාඅප'තරේ වූ කතාරැය පුරාඋණුහුමේ මල් පෙති තලාසයනයත්නිදනවාමේ රැය අපගේ වූ නිසාආදරෙන්නග්න වූ හිමිකම් සොයාඋණුසුම් උදයක සුවඳින් ගත පිබිදී ගියාඔබේ නම සොයනව තාමත් නිය සිතුවම් පුරාසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනාකාමරේමුළු පුරානෙක සළු පිළි තනිවෙලාමා සිතින්හඬනවා දෙස බල බලාමංමුලාවූ සිතින්මා මල් සුවඳක් විඳිනවානැති ඉමක්ඇති රුවක් හා මා වෙලීඋණුසුම් උදයක සුවඳින් ගත පිබිදී ගියාඔබේ නම සොයනව තාමත් නිය සිතුවම් පුරාසරාගයේරැයේපිණිබිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනාසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන් තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීසරාගයේරැයේපිණි බිඳුවක් වී වැටීමා සිතේ හිඩසක් මවායහන්තලේවැතිරීඅද තනිකම ඉතුරු වීසඳ ඇතිරිල්ලෙන් වෙලීතනි උනා",
    "metaphor": "රැය පුරාඋණුහුමේ මල් පෙති තලා",
    "meaning": "Lips are kissed at night",
    "source": "Lips",
    "target": "Flower petals"
  },
  {
    "title": "Awasan warata kala pem satana",
    "artist": "Sanuka",
    "album": "Awasan Satana",
    "releasedYear": "2020",
    "lyricist": "Sanuka",
    "lyrics": "අවසන් වරට කළ පෙම් සටන ළඟ මා පැරදුනේඅවසන් වසර මා හා ගෙව්ව පෙම අවසන් වුනේසරසවි උයන තනි වූ දිනෙක මා එහි තනි වුනේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේනුඹ හා ගෙව්ව මොහොතක සුවය හන්තානට වැඩිගිනිගත් හදට රාගී සුවඳ දළු දැම්මා නිතිවරහන් නොමැති ආදර ගීය නුඹ ගැයුවේ බැඳිනුඹ කළ පෙමට මා දුන් දුකම දැන් මා විඳවමිනුඹ කළ පෙමට මා දුන් දුකම දැන් මා විඳවමිඅවසන් වරට කළ පෙම් සටන ළඟ මා පැරදුනේඅවසන් වසර මා හා ගෙව්ව පෙම අවසන් වුනේසරසවි උයන තනි වූ දිනෙක මා එහි තනි වුනේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේමල්වර නැකත වැරදී උන්න ඇය හා මා බැඳිසංවර සසර ළඟ මා නිරය මැව් බව මා දනීපූජාසනය සේ මා දුටුව නුඹටම එරෙහි වීතව මල් පිපෙන තුරු ළඟ උන්න කාලය වැරදුනිතව මල් පිපෙන තුරු ළඟ උන්න කාලය වැරදුනිඅවසන් වරට කළ පෙම් සටන ළඟ මා පැරදුනේඅවසන් වසර මා හා ගෙව්ව පෙම අවසන් වුනේසරසවි උයන තනි වූ දිනෙක මා එහි තනි වුනේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේවිඳි පෙම් සුවඳ මහවැලි ඉවුර ළඟ මිහිදන් කළේ",
    "metaphor": "නුඹ හා ගෙව්ව මොහොතක සුවය හන්තානට වැඩි",
    "meaning": "Joy spent with you is unmeasurable /very big ",
    "source": "Big joy",
    "target": "Mountain"
  },
  {
    "title": "Ahase tharu kan niwila dukakin wage",
    "artist": "Ruwan & Raini",
    "album": "Mathakada Hendewe",
    "releasedYear": "2011",
    "lyricist": "Nilar N. Casim",
    "lyrics": "අහසේ තරු කැන් නිවිලා දුකකින් වගේඅඳුරේ හෑඬුවා රහසේතනිකම ඉහිලුම් නොදේගිලුනා හද මා අඳුරේඔබ පෙරදා ආදරේන් මා ලගින් උන් හැටීඑහි සැමරුම් රූ තමයි ජීවිතේමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාතනිකම් දැනුනත් හිතට මතකය නැහැ නික්මිලාමනරම් හැඟුම් දහස සොඳුරේ ඔබමයි සැමදාඔබ පෙරදා ආදරේන් මා ලගින් උන් හැටීඑහි සැමරුම් රූ තමයි ජීවිතේමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාසුසුමේ වෙලී උණුසුම් වෙවී වස්සානයේ අප ළං වූ හැටීහිරිමල් හිතේ හීනයක් වගේ හීනයක්ද ගීතයක්ද මේ ජීවිතේඔබ පෙරදා ආදරේන් මා ලගින් උන් හැටීඑහි සැමරුම් රූ තමයි ජීවිතේමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනාමතකද හැන්දෑවේ අපි දෙන්නා මන්දාරම් අඳුරේදවසක් දා මල් වැස්සේ තෙමුනා",
    "metaphor": "මල් වැස්සේ තෙමුනා",
    "meaning": "Get wet by small rain",
    "source": "Rain drops",
    "target": "Flowers"
  },
  {
    "title": "Master Sir",
    "artist": "Bathiya and Santhush",
    "album": null,
    "releasedYear": "2009",
    "lyricist": "Bathiya and Santhush",
    "lyrics": "පනම් අටෙන් මට වැඩිකර දුන්නාහැකි වුනත් බත් මිටක් දරුවට කවන්නමාස්ටර් සර් මගෙ හිමි තැන දෙනවාදෝඅනේ සර් අනුකම්පා නොසිතේදෝඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේනිම වෙන්නට කල් ගත වෙයි දෝඅනේ සර් අපි මිතුරන් වෙයිදෝඑදා දවස උදා වේවිදෝඑදා දවස උදා වේවිදෝමට මතක් වෙනවා සුද්දා තැලූ පෙලූ හැටිඅපි කතා කලේ පන ගැහි ගැහි දනින් වැටීමාස්ටර් සර් මගෙ හිමි තැන මට දෙන්නඅනේ සර් කරුණාවෙන් සලකන්නඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේනිම වෙන්නට කල් ගත වෙයි දෝඅනේ සර් අපි මිතුරන් වෙයිදෝඑදා දවස උදා වේවිදෝඅප අතරේ කඹ ඇදිල්ලේ තරගේ මේනිම වෙන්නට කල් ගත වෙයි දෝඅනේ සර් අපි මිතුරන් වෙයිදෝඑදා දවස උදා වේවිදෝඑදා දවස උදා වේවිදෝඑදා දවස උදා වේවිදෝ",
    "metaphor": "අප අතරේ කඹ ඇදිල්ලේ තරගේ මේ",
    "meaning": "Competition between two peoples",
    "source": "Competition ",
    "target": "Pulling the rope"
  },
  {
    "title": "Ranwan Maldam",
    "artist": "Centigradz",
    "album": "Rusiri",
    "releasedYear": "2009",
    "lyricist": "Centigradz",
    "lyrics": "රන්වන් මල්දම් සොද ගොතා මා අතින්ගෙන නිල් වරලස හැඩ දමා සිතින්මන්මත් කරදා මුදු සිනහ මල් සරින්සැනසෙන්නම් සොඳුර නුඹ මතින්රන්වන් මල්දම් සොද ගොතා මා අතින්ගෙන නිල් වරලස හැඩ දමා සිතින්මන්මත් කරදා මුදු සිනහ මල් සරින්සැනහෙන්නම් සොඳුර නුඹ මතින්ඔය මුදු පහසෙ දැවටෙන්න මගෙ ජීවිතේසඳ කිරණක්ව සරසන්න මගෙ ආදරේමට පවසන්න ඔය නෙතඟෙ බැඳි ආදරේමගෙ හිත තාම නුඹ ගාව රැඳිලා තියේතුරුලට රැගෙන ආදරෙන් සිඹිමින්හැඟුමක පැහැය නුඹෙ දෙතොලෙ තබමින්හෙමිහිට ළමැද මත හුස්ම තබමින්සෙනෙහෙස පතමි නුඹෙ දැහැනෙ රැඳෙමින්තුරුලට රැගෙන ආදරෙන් සිඹිමින්හැඟුමක පැහැය නුඹෙ දෙතොලෙ තබමින්යහනක සතපවා සිහින දකිමින්මියැදුණු සඳක නුඹ පතමි ස්නේහෙන්ඔය මුදු පහසෙ දැවටෙන්න මගෙ ජීවිතේසඳ කිරණක්ව සරසන්න මගෙ ආදරේමට පවසන්න ඔය නෙතඟෙ බැඳි ආදරේමගෙ හිත තාම නුඹ ගාව රැඳිලා තියේ",
    "metaphor": "මියැදුණු සඳක නුඹ පතමි",
    "meaning": "Wish a girl by hopless life",
    "source": "Hopeless life",
    "target": "Dark moon"
  },
  {
    "title": "Kollane Yan",
    "artist": "Dhanith Sri",
    "album": null,
    "releasedYear": "2021",
    "lyricist": "Dhanith Sri",
    "lyrics": "Are you ready(are you ready)Dhanith Sri (dhanith sri)Block and dinoLets goYeahYeahඔව් කියන්නSo Sexyඉක්මනට කියන්නබොක්ක ෆෝම් කරන්නඔව්Let's goජය ටැබ කරා ආබිමන් දරාඑකහදවතින් පියමන් තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේප්ලාස්ටික් බෝතල් විසි කරන්නෙපාපැරදුම ඇති දිනුමක් නැතිරෙදි නැති අතීතයට තිත තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේප්ලාස්ටික් ස්ට්රෝස් බිම දාන්න එපාපන්දු යවන්න පොලු ගැලවෙන්නහෙටසිට යං ජය අරගන්නනවතින්නෙ නැති ජය පැරදුම එකයි කීවටඉඩක් නම් නෑ දැන් පරදින්නකොල්ලනේ යං ඉදිරියටම යංඒකාලෙ වගේ අපි ආයෙත් Number one වෙනකන්ඉගිලෙන්න තටු නැතුවට අපෙකොල්ලන්ටබෝලෙයි බැට් එකයි ඇති මේ ලෝකෙ ජයගන්නහරි දනිත් ඇති ප්ලාස්ටික් ගැන කතාකරමු අපීයන යන තැන ප්ලාස්ටික් විසිකරන ජරාගතිකුනු බාල්දිය පෙනි පෙනි බිම දාන සක්කිලිඅම්ම ගහයි බැට් එකෙන් මෙහෙම ගියොත් තොපිකොල ඉදුල් ප්ලාස්ටික් ගෙදර mix කරනකොටඒවා එකතු වෙන්නෙ මේ මහපොලොවටවතුරට ඇලදොල ගං මුහුදටමෙහෙම ගියොත් ප්ලාස්ටික් මයි කන්න වෙන්නෙ තොටජය ටැබ කරා ආබිමන් දරාඑකහදවතින් පියමන් තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේයෝගට් කාලා හැදි කප් වැල්ලට දාන්නෙපාපැරදුම ඇති දිනුමක් නැතිරෙදි නැති අතීතයට තිත තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේකොන්ඩම්ස් හොදයි හැබැයි ඒවා විසිකරන්න එපාමුලු ලෝකෙත් එක්ක කරට කරසිංහයෝ රගදෙනවා පිටිය මැද2021 අද ජය කනුව ලග සිංහ කොඩිය ගහනවා අනිවාර්යයෙන්මමොකද ශ්රීලන්කන් කොල්ලො හරිම වසයියකඩ බෝල දෙකට තුනට හතරට පලයිඑක පිට එක බැට කෑවත් ඊයෙ ලමයිඅඩියෙන් අඩිය හරි තියලා නැගියිනවමයිආයුබෝවන් සියලුම ක්රිකට් ෆෑන්ස්ලටඅපි ආදරෙයි gentlemens ක්රීඩාවඅතීතයෙ ප්රව්ඩ මතක් වෙනවනෙ තාමආයෙත් ලියමු එක අකුරක් නෑරමTeam එක ඇතිJersey ය ගැන කතාකරමු අපිRecycle plastic වලින් මහලා පට්ට ගතිබෝතල් තිස්දාහක් polyester කරා පටිඑහෙම තමා ගැහුවෙ ගේම හිතනකොටත් හතිවෙනස් වෙන්න ඕනෙ කියන වෙනස වෙමු අපිMother Nature ට මල පැන්නොත් කන්න වෙන්නෙ ටොපිප්ලාස්ටික් ඇතිටීම් එකට සප් එක දෙමු අපිමෙන්න දුන්න බැට් එක ගහපං දනිත් සිරිSri not SiriAmmatasiri Sorryකොල්ලනේ යංඒකාලෙ වගේ ආයෙත් Number 1 වෙනකංකියපං දනිත්World cup එක දිනන්න හැබැයි ප්ලාස්ටික් පාවිච්චි කරන්න එපාජය ටැබ කරා ආබිමන් දරාඑකහදවතින් පියමන් තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේප්ලාස්ටික් පැකට් තියන මොකුත් කඩෙන් ගන්න එපාපැරදුම ඇති දිනුමක් නැතිරෙදි නැති අතීතයට තිත තියාඅපි ඉදිරියටම යමු දැන් කොල්ලනේසිලිකන් ඇතුලෙ තියාගන්නවිසිකරන්න එපාහරි එහෙනම් අපි ගිහිල්ල එන්නම් Thank you very muchඅපි ගිහිල්ල එන්නම් thank you so muchCricket බොක්ක සින්දුවක් අස්සෙප්ලාස්ටික් එපා කියලා ඇඩ් එකක්එබුවාකොහොමහරිBlock and DinoDhanith Sriජයවේවාබායි thank you",
    "metaphor": "රෙදි නැති අතීතයට තිත තියා",
    "meaning": "Put an end to the embarassing past",
    "source": "Embarassment",
    "target": "Lack of clothing"
  },
  {
    "title": "Loka Sithiyama",
    "artist": "Methun SK",
    "album": "Loka Sithiyama",
    "releasedYear": "2022",
    "lyricist": "Methun SK",
    "lyrics": "Bro, හ්ම්මොනවද අලුත් ප්රශ්න?හ්ම්-ම්ම් හ්ම්-ම්ම්හ්ම්-ම්ම් හ්ම්-ම්ම්හෝ-හෝ හෝ-හෝහෝ-හෝ හෝ-හෝලෝක සිතියම තට්ට තනියමපීරුවා මම ඇත්ත හොය හොයලෝකෙ කෙලවර දන්නෙ නැතිවමපෙරලුනා ලෝකාන්තයකටවර්ගයා නසාගෙනස්වර්ගයා හොයා යනමුර්ගයන් ඉන්න ලෝකෙකසොයනවා අපි වසන්තයවේදනා දැකලාහේතුවක් සොයලාවේදනා නැති ලෝකෙක මං සොයා යනවාවේදනා දැකලාහේතුවක් සොයලාවේදනා නැති ලෝකෙක මං සොයා යනවාමල් නෙලාගෙන තුට්ටු දෙක තුනසොයනවා රෑ කෑම වේලටපහු කරන් යන වන්දනා නඩසොයනවා සුව ආධ්යාත්මිකප්රාන්තේ ඇති වේදනාවටඅනන්තේ දුර යන්නෙ මොකටද?වසන්තේ අග මල් පිපෙනකන්නිරන්තරයේ දුක් විඳින්නද?වේදනා දැකලාහේතුවක් සොයලාවේදනා නැති ලෝකෙක මං සොයා යනවාවේදනා දැකලා (වේදනා දැකලා)හේතුවක් සොයලා (හේතුවක් සොයලා)වේදනා නැති ලෝකෙක මං සොයා යනවාවේදනා දැකලාහේතුවක් සොයලාවේදනා නැති ලෝකෙක මං සොයා යනවාවේදනා දැකලාහේතුවක් සොයලාවේදනා නැති ලෝකෙක මං සොයා යනවාකරගහන් එන හේතු ඵල ටිකගෙවනවා තව එකතු කරගෙන",
    "metaphor": "සොයනවා අපි වසන්තය",
    "meaning": "We are looking for a good lifw",
    "source": "Success",
    "target": "Spring"
  },
  {
    "title": "Ahasai Oba Mata",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Bandula Nanayakkara",
    "lyrics": "අහසයි ඔබ මට නිම් හිම් නොපෙනෙන ඉණිමං බඳිනු බැරී පොළොවයි ඔබ මට තරුවක් විලසට රෑ කල පතිත වෙමි // ගඟේ වතුර නෑ ඉහලට ගලා ගියේ අසිනි හඬින් නෑ කඳු බිම් සසල උනේ ගඟ කවදා හෝ මුව දොර හමු වෙනවා ලොව කැලඹුණු දා කඳු බිම් හැකිලෙනවා අහසයි ඔබ මට... අනාත සයුරට වැහි දිය දෝත ඔබයි අගාධ අඳුරක දුල රන් සිළුව ඔබයි ඔබ මට ලඟ බව ඉඳුරා මම දනිමී ඔබ වට කහවනු පවුරට මහ දුරකී අහසයි ඔබ මට... //",
    "metaphor": "අහසයි ඔබ;පොළොවයි ඔබ",
    "meaning": "You are not as close as the sky; when I am a star, you are not as far as the earth",
    "source": "Sky, Earth",
    "target": "You"
  },
  {
    "title": "Maa Ithn Yanna Yanawa",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Rathna Sri Wijesinghe",
    "lyrics": "මා ඉතින් යන්න යනවා මට යන්න අවසරයි මට අරන් යන්න ඇත්තේ ඒ මතකය විතරයි නුඹ සඳක් වෙලා පායා මට එළිය වුණු වගයි නුඹ සඳක් සේම බැස යයි මට ඉතිරි කළුවරයි මගෙ මතක එපමණයි මා ඉතින්... සඳ එළිය අයිති ලොවටයි සඳ අයිති අහසටයි පිණි කඳුළු බිංදු විතරක් මේ බිමට වැටෙනු ඇයි මට උරුම එපමණයි මා ඉතින්...",
    "metaphor": "නුඹ සඳක් වෙලා පායා මට එළිය වුණු වගයි",
    "meaning": "You light up my world like the moon",
    "source": "Moon",
    "target": "You"
  },
  {
    "title": "Seethala Diya Piri Sunila Wilai",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Mahagamasekara",
    "lyrics": "සීතල දිය පිරි සුනිල විලයි.... ඒ විල මැද ඔබ සුවඳ මලයි .... ගිමන් නිවාලන සුළං රැලක් වී ඔබේ සිනා මට පවන් සලයි.....  අසරණ වී මා ජීවිත කතරේ අන්ධකාරයේ සැරිසැරුවා ඔබේ නිහඬ නෙත ඈත සිතිජයෙන් උදාවෙලා මට අත වැනුවා  දෑසට නොපෙනෙන ඝන නිල් අඳුරේ ඔබේ හදින් මා දෙස බැලුවා දෑසට නොපෙනෙන මා හද පතුලේ සුන්දරතාවය ඔබ දුටුවා  ඔබේ කුසුම ඔබ දෝතින් අරගෙන ආදරයෙන් මා වෙත පිදුවා ඒ මොහොතෙම තව සිය දහසක් මල් මා වට කර හැමතැන පිපුණා",
    "metaphor": "ඔබ සුවඳ මලයි;ගිමන් නිවාලන සුළං රැලක් වී ඔබේ සිනා",
    "meaning": "You adorn my life as a flower perfumes a lake; your laughter relieves my fatigue as a breeze relieves fatigue",
    "source": "Fragrant flower",
    "target": "Your smile"
  },
  {
    "title": "Nim Therak Nodutu",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Bandula Nanayakkara",
    "lyrics": "නිම් තෙරක් නොදුටු මේ ලෝකයේ රුදු සපුන් නිබඳ සරනා බිමේ // ඔබේ සිනා වත මගේ නවාතැන අරුණු විහිදුවාවී ජීවිතයේ රැල් නගා ගලන ගංගා දියේ මං වසා දමනු හැකිදෝ කෙසේ // සොයා සයුරු දිය හඹා ඇවිත් ගඟ සදා සැඟව යාවී සාගරයේ සිල් බිඳී මුවන් කැලඹූ වනේ බිම නොලා නෙලූ ඵල මාවතේ // සදා ඔබේ ගිම් බෙදාගනිම් මම් තැවුල් සැඟව යාවී මාරුතයේ නිම් තෙරක් නොදුටු මේ..",
    "metaphor": "ඔබේ සිනා වත මගේ නවාතැන",
    "meaning": "Your smile is a comforting shelter in my life",
    "source": "My home",
    "target": "Smile"
  },
  {
    "title": "Hade Kothanaka",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Kumaradasa Saputhanthri",
    "lyrics": "හදේ කොතැනක හෝ හිඳී ඔබ නිදා නොනිදා මෙන් බලා අවසර සොයා කල් දැන වෙලා හස රැහැනින් පෙළයි මා, මුදා සුව දැහැනින් // සයුර ඉම රත් සිතිජ රේඛාවේ මියෙන හිරු සේ ගිලී ගිම් අඳුරේ තලා මා සිත පලා ගිය ඔබ දවයි මා….හද, තනිවෙනා මොහොතින් හදේ කොතැනක... උතුම් පිවිතුරු ප්‍රේමයේ නාමෙන් සහස් සුවහස් පැතුම් බල මහිමෙන් ඉනූ කඳුලද සිඳෙන්නට පෙර යදින්නම්…. ඔබ, මැකී යනු මතකෙන් හදේ කොතැනක…",
    "metaphor": "සයුර ඉම රත් සිතිජ රේඛාවේ මියෙන හිරු සේ ගිලී ගිම් අඳුරේ තලා මා සිත පලා ගිය ඔබ දවයි මා",
    "meaning": "As the setting sun darkens a world on the horizon, you leave me in agony",
    "source": "Dying sun",
    "target": "My feelings"
  },
  {
    "title": "Handana Pana Nala Yadina Sanasuma",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "K.D.K. Dharmawardane",
    "lyrics": "හඬන පන නල යදින සැනසුම දැවී යයි හද චිතකයේ කඳුලු බිඳුවක සිසිල පමනකි වියලි කතරට හිමි වුනේ . .  යොවුන් සිතිවිලි විපිලිසර වී මහළු ලොව තුල මිය ඇදේ සයින් පීඩිත හඬන සුරගුරු යදී සිඟමන් මාවතේ  රකුසු පියසක පිපුනු කුසුමක මලවි හමුවන පින නැතේ දෑස නැති විට නුහුරු මංපෙත සරන පා යුග පටලැවේ",
    "metaphor": "දෑස නැති විට නුහුරු මංපෙත සරන පා යුග පටලැවේ",
    "meaning": "When there are no eyes, it is difficult to go through the unfamiliar journey of life alone without shelter or love",
    "source": "Unfamiliar road",
    "target": "Blind love"
  },
  {
    "title": "Pana Mada Kadithi",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Mahinda Chandrasekara",
    "lyrics": "පැන මඩ කඩිති වැව් තාවලු වැහි කාලේ පෙන්නා මග නොමග නොවැටී යන තාලේ සිප් කිරි පෙවූ මූසිලයින් උඩු මාලේ අපෙ ගුරුතුමා යයි තාමත් ඉස්කෝලේ සාමා අමර විකුණති බස් පොළේ කජු කුමාරෝද පිටු දන් දෙති එයින් මතු උගත මනා ශිල්පය පිල් කඩ නොපැතූ වේවැල වටා ඉකිබිඳ දඬුවමක් පැතූ රන්මසු පටපිළී අබරණ උරණ වෙලා සමන්පිච්ච කැකුළිය ගෙයි මිලින වෙලා ගුරු නිවහනේ කඳුලට උල්පතක් වෙලා ලොකු හාමිනේ ඇත බිතු සිතුවමක් වෙලා පැන මඩ කඩිති වැව් තාවලු ...",
    "metaphor": "සිප් කිරි පෙවූ මූසිලයින් උඩු මාලේ අපෙ ගුරුතුමා යයි තාමත් ඉස්කෝලේ",
    "meaning": "Our teacher is like Musila Aduru, who bestows knowledge on children",
    "source": "Bad student",
    "target": "Teacher"
  },
  {
    "title": "Miniseku Pita Nagi Asaruweki",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Premakeerthi De Alwis",
    "lyrics": "මිනිසකු පිට නැගී අසරුවෙකි ඒ බර ගෙයි වහලට බරකි පාන්දරින් පැරදුන ඒ මිනිහා හැන්දෑවෙත් අසු පිටට නගී....  හෙට මම ගෙදරට සුර සැප දෙනවා අද රෑ ලුණුමිරිසෙන් ගතවෙනවා කාසි මල්ල සතෙකුගේ පිට යනවා දු දරුවන් පැදුරේ නිදියනවා....  ඉරණම විසදුම සතෙකුට දෙනවා තිරිසනෙකුට මිනිසකු පරදිනවා දරුවන් බිරිදත් ගිනි උහුලනවා හීනෙන් නුබ තව ගෙවල් හදනවා",
    "metaphor": "ඒ බර ගෙයි වහලට බරකි",
    "meaning": "The burden of wealth in the home is felt by the loss of wealth caused by someone's gambling addiction",
    "source": "Home roof",
    "target": "Cost of living"
  },
  {
    "title": "Dewani Budhun Lesa",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Sunil Ariyarathne",
    "lyrics": "දෙවැනි බුදුන් ලෙස ලොවම උවම් කල ලොවක පිදුම් ලද ලොවට උතුම් ලඳ අම්මා.....අම්මා..... දෙසවන් සනහා මා නැලවූ ඔබ මියුරු මියැසියේ අරුත කියා දුනි ඒ මියැසිය අද මා ගයනා විට මා සිපගන්නට ඔබ මා ලඟ නැත අම්මා....අම්මා..... ඇසට හඬන්නට කඳුලැලි දුන් ඔබ ලතැවුල් දරනා දිරිය ලබා දුනි ඒ දිරියෙන් ලොව ජය ලබනා විට මා සිපගන්නට ඔබ මා ලඟ නැත අම්මා....අම්මා..... දෙවැනි බුදුන් ලෙස...",
    "metaphor": "දෙවැනි බුදුන් ලෙස ලොවම උවම් කල ලොවක පිදුම් ලද ලොවට උතුම් ලඳ අම්මා.",
    "meaning": "Mother is like a second Buddha who comforts people and guides them on the right path",
    "source": "Second Buddha",
    "target": "Mother"
  },
  {
    "title": "Minisa Suwandai Malasee",
    "artist": "Sunil Edirisinghe",
    "album": null,
    "releasedYear": "2000",
    "lyricist": "Kumaradasa Saputhanthri",
    "lyrics": "මිනිසා සුවඳයි මල සේ නුවණින් එළියයි හිරු සේ පරවී වැටිලා ඒ හිරු මල මේ දෙරණේ පොළවේ උරුමේ කියමින් බිලිදී විහිඟුම් ගුණදම් දහසින් මියෙනා සටනින් අඟලේ හිමිකම් සොයමින් ලොව නහවා සෝ කඳුලින් සැනහේ ජය පැන් පුරමින් මිනිසා සුවඳයි.... උණු ලේ විෂ වී සිරුරේ ඉසුරන් ගැටෙනා අතරේ ගිනි මල් පිපිලා අහසේ ඇවිලේ ගිනි දැල් සයුරේ සා පවසින් ඉකි බිඳිනා සුසුමෙන් යදියන් හෙලනා මිනිසා සුවඳයි...",
    "metaphor": "උණු ලේ විෂ වී සිරුරේ ඉසුරන් ගැටෙනා අතරේ ගිනි මල් පිපිලා අහසේ ඇවිලේ ගිනි දැල්",
    "meaning": "The hot blood poisons and collides with the body like a fire in the sky",
    "source": "Fire flowers in the sky",
    "target": "Warm blood"
  },
  {
    "title": "ZD8",
    "artist": "Charitha Attalage",
    "album": "Dura Akahe Master Collection by Charitha Attalage",
    "releasedYear": "2022",
    "lyricist": "Kasun Edirisinghe",
    "lyrics": "කොහොඹ කණුවේ රැහැයියො ඉන්නවාඋන් රෑ මගෙ තනිකම මකනවානුඹ තාමත් දොරකඩ ඉන්නවා දැනෙනවාරෑ හීනෙන් ඇවිදින් ඉන්නවාඋඹ කකුලෙන් අදිනවා දැනෙනවාමම දන්නේ නැතිවම කඳුලක් වැටෙනවාඒත් අසලින් ඇවිදින් ඉන්නවාමට ඒ බව ඉඳහිට දැනෙනවානුඹ තාමත් ගෙපිලේ ඉන්නව හැඟෙනවාරෑට හීනෙන් ඇවිදින් ඉන්නවානුඹ කොනිත්තුවා මට දැනුනාරැහැයියො නාඩන් හාමිනෙ තාමත් ඉන්නවාසුදු පාටින් නෑ සිල් රෙදි කහ පාටට හැරිලාසේපාලිකා මල් සංකාවෙන් තනිවම පිපිලාපිපුණු පැණිකොමඩු මල් එතැනම පරවී වැටිලාමගේ පොඩී එකී තුන් මාසෙන් පසු ගම යනවාගේ මැද පාළුයි මතකය පෑරෙයියන එන හැම තැන නුඹ මැවිල පෙනෙයිඉරිඟු හේන මහා ඔත්පල වෙනවාමගෙ ඇතින්නියේ නුඹ මහ ඇල අරගෙන යනවාහතර පෝයට නුඹ සිල් ගන්නවාඋරබන්දිය විස්තර අහනවානුඹ තාමත් දොරකඩ ඉන්නවා දැනෙනවාවැඳපු දෙවිවරු නෑ අද වඩිනවානුඹ මඟහැරලා උන් ඉන්නවාමම දන්නේ නැතිවම කඳුලක් වැටෙනවාහවස් යාමෙට නුඹෙ කවි ඇහෙනවාමම දෑස් වසාගෙන අහනවානුඹ තාමත් ගෙපිලේ ඉන්නව හැඟෙනවාවැරදිකාරයෝ මුනිවත රකිනවාදඬුවම් නැති බව උන් දන්නවානුඹ උදුරාගිය ඇල තවමත් ගලනවාරෑට හීනෙන් ඇවිදින් ඉන්නවානුඹ කොනිත්තුවා මට දැනුනාරැහැයියො නාඩන් හාමිනෙ තාමත් ඉන්නවා",
    "metaphor": "හවස් යාමෙට නුඹෙ කවි ඇහෙනවා",
    "meaning": "I hear the sound of the elephant in the evening like it's a poem",
    "source": "Sound of an element",
    "target": "Poem"
  },
  {
    "title": "Miyuru pem madirawe",
    "artist": "Ranil Mallawarachchi",
    "album": "Samanala Renak Se",
    "releasedYear": "2007",
    "lyricist": null,
    "lyrics": "මියුරු පෙම් මදිරාවේනුහුරු රස දැනුනාවේසත්සරේ... රැව් දිදීපුරවන්න මා දෙසවන් මිහිරේදෙතොල් පෙති පුබුදාලාපියුම් පැහැ විහිදාලාදෙනෙතෙහී නිල්මිණීලෙළවන්න මා නලවා සොඳුරේමියුරු පෙම් මදිරාවේහසරැල් අමාදියේ, තිසරුන් තෙමී ගියේහසරැල් අමාදියේ, තිසරුන් තෙමී ගියේරන්වන් ලතාවෙන් ඉන්න ලංවීසුදේහිනියේ දිවා රැයේමියුරු පෙම් මදිරාවේනුහුරු රස දැනුනාවේසත්සරේ... රැව් දිදීපුරවන්න මා දෙසවන් මිහිරේමියුරු පෙම් මදිරාවේකඳු හෙල් මැදින් ඇදී, එමි ආදරේ සොයාකඳු හෙල් මැදින් ඇදී, එමි ආදරේ සොයාසිහිනෙන් පැතූ සේ වස්තුවක් දැන්තියේ හිමිවී මගේ කියාදෙතොල් පෙති පුබුදාලාපියුම් පැහැ විහිදාලාදෙනෙතෙහී නිල්මිණීලෙළවන්න මා නලවා සොඳුරේමියුරු පෙම් මදිරාවේනුහුරු රස දැනුනාවේසත්සරේ... රැව් දිදීපුරවන්න මා දෙසවන් මිහිරේමියුරු පෙම් මදිරාවේ",
    "metaphor": "දෙනෙතෙහී නිල්මිණී",
    "meaning": "Blue eyes",
    "source": "Eye",
    "target": "Blue gem"
  },
  {
    "title": "Roda hathare maligawa",
    "artist": "Asanga Priyamantha Peiris",
    "album": null,
    "releasedYear": "2009",
    "lyricist": "Asanga Priyamantha Peiris",
    "lyrics": "රෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවරෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවපිටුපස දූවිලි වලාවපිටුපස දූවිලි වලාවකැරකෙනවා...අපි අයින් වෙලාපයින් යමු පුතේ...ඇතුල නුවරඑලිය වගේපිටතින් කළුවලා නැගේබාගෙට සිංහල බාගෙටඉංගීසිය මරන රගේඉංගීසිය මරන රගේරෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවරෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවපිටුපස දූවිලි වලාවපිටුපස දූවිලි වලාවකැරකෙනවා...අපි අයින් වෙලාපයින් යමු පුතේ...රන්පොටවල් දිලිසෙනවාළාදළු සේ බැබලෙනවාචීස් බටර් වලින් තැනූදෙව් රූපය ඇවිදිනවාරෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවරෝද හතරේ මාලිගාවකලුවර වීදුරු ගුහාවපිටුපස දූවිලි වලාවපිටුපස දූවිලි වලාවකැරකෙනවා...අපි අයින් වෙලාපයින් යමු පුතේ.",
    "metaphor": "රෝද හතරේ මාලිගාව",
    "meaning": "Palace with wheels",
    "source": "Vehicle",
    "target": "Palace"
  },
  {
    "title": "Sagara badu wedanawo",
    "artist": "Senanayaka Weraliyadda",
    "album": null,
    "releasedYear": 2014,
    "lyricist": "Shantha Deshabandu",
    "lyrics": "සාගරය බඳු වේදනාවෝසුන්වෙලා යනවෝජීවිතය ගෙන වන්දනාවකයන්න අපි යනවෝ ...සාගරය බඳු වේදනාවෝසුන්වෙලා යනවෝජීවිතය ගෙන වන්දනාවකයන්න අපි යනවෝ ...MUSICපෙරුම් පුරනා බෝසතුන්ටත්මාර සෙන් සිටියෝඉතින් එහෙනම් අපට නැතිවෙදරුදුරු බාධාවෝපැමිණි දුක්‌ කඳ පැණිරසක්‌ ලෙසබෝසතුන් සිතුවෝඉතින් එහෙනම් අපිත් ඉවසමුදුක්‌ඛ ගංගාවෝසාගරය බඳු වේදනාවෝසුන්වෙලා යනවෝජීවිතය ගෙන වන්දනාවකයන්න අපි යනවෝMUSICඑදා කඳුලැල් මෙදා හසරැල්පැතුම් ඉටුවෙනවෝපැතුම් හොඳනම් යනෙන ගමනෙදිසිහින එළිවෙනවෝමිනිස්‌ ලොවකට ලබන්නට බැරිජයක්‌ කොතැනකදෝමිනිස්‌කම් මත දිවි ගෙවයිනම්ඔවුන් ජය ලැබුවෝසාගරය බඳු වේදනාවෝසුන්වෙලා යනවෝජීවිතය ගෙන වන්දනාවකයන්න අපි යනවෝ ..සාගරය බඳු වේදනාවෝසුන්වෙලා යනවෝජීවිතය ගෙන වන්දනාවකයන්න අපි යනවෝ",
    "metaphor": "පෙරුම් පුරනා බෝසතුන්ටත්මාර සෙන් සිටියෝ",
    "meaning": "Every person may have enemies",
    "source": "Enemies",
    "target": "Death army"
  },
  {
    "title": "Paya a sanda aduru walawen",
    "artist": "Milton Mallawaarachchi",
    "album": "Milton Pranama",
    "releasedYear": "2000",
    "lyricist": "Milton Mallawaarachchi",
    "lyrics": "පායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනාසෝකය තාපය පාළුව අතරේඉකිබිඳ හැඬුවා ඇසුණාපායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනාහද විමනේ බිතු සිතුවම්කිලිටි කළේ ඔබෙ දෑතයිකිලිටි කළේ ඔබෙ දෑතයිනොපැතු වියෝගයෙ මහ වරුසාවෙන්දෑත දෙපය මගෙ සීතයිදෑත දෙපය මගෙ සීතයිපායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනාඔබ පැමිණී ඔබම ගියානැවතුණ තැන මම ඉන්නම්නැවතුණ තැන මම ඉන්නමමගෙ සහයෝගය පතන වෙලාවේකොහි සිට හෝ යළි එන්නම්කොහි සිට හෝ යළි එන්නම්පායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනාසෝකය තාපය පාළුව අතරේඉකිබිඳ හැඬුවා ඇසුණාපායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනා",
    "metaphor": "පායා ආ සඳ අඳුරු වළාවෙන්මා ඉදිරියෙදිම වැසුනා",
    "meaning": "Beak  strong faith infront of someone",
    "source": "Faith",
    "target": "Rising moon"
  },
  {
    "title": "Nihanda gamane",
    "artist": "Bachi Susan",
    "album": null,
    "releasedYear": "2013",
    "lyricist": "Bachi Susan",
    "lyrics": "නිහඬ ගමනේ මේතරම් දුරඇවිද අපි එකවාගේමිහිරි මතකේ සැරිසරා ඔබනවාතැන් ගෙන දෑසේබඹර නාදේ ඇසෙන මානේරැඳෙනු මාගේ සුවඳ වාගේ...//ප්‍රාර්තනා තවරා ආදරේ ඉන්න ඉඩදෙන්න තුරුලේහිනැහෙනා කල්පනාඔබ නිසයි ජීවිතේඇගිලි තුඩු තදකර මගෙ නලලේසිබින සියුමැලි නුබෙ දෙතොලතරේගැබුරු හද කැලබුව ඔය කදුලේරහස නොහැගේ මගෙම ළදුනේආ....දෑත් විදා ලමැදේ ආදරේදෙන්න විදගන්න රිසිසේනිමනොවේ කිසිදිනේ පෙම්පැතුම් මා හදේලබන හැම ආත්මයම ඔබගේළගම ඉන්නයි මම නම් පැතුවේපණට පණ දීම් දිවි කතරේනොයමි රහසේ රකිමි පනසේනිහඬ ගමනේ...",
    "metaphor": "නිහඬ ගමනේ මේතරම් දුරඇවිද අපි එකවාගේ",
    "meaning": "Secret love went far by cheating with someone",
    "source": "Secret love",
    "target": "Silent joruney "
  },
  {
    "title": "Hima renu watena sithale",
    "artist": "Latha Walpola",
    "album": "Pem Nalaville",
    "releasedYear": "2008",
    "lyricist": "Saman Chandranath Weerasinghe",
    "lyrics": "හිම ‍රේණු වැටෙනා සීතලේ නෙත ගාව රදවා ආදරේ.. සුදු සේල සුළ‍ඟේ පා කලේ ඔබ නේද මාගේ බිසෝ.. රන් තෝඩු සැලෙනා රාවයේ සිත ගාව බැන්ඳු මාලි‍ගේ රතු රෝස යහනා සෑ‍දුවේ මට නේද මගෙ මල් සරෝ.. මදු පානයක් සේ ගෑවිලා යනවා ද දෙතොලේ ගෑවිලා.. මනමාලයන්ගේ චේතනා නොකියා ද පාලා සිනා.. හිමරේණු වැටෙනා...// මුතු මාලයක් සේ යාවුනේ අපි ආත්ම ගණනේ පෑ‍ සෙනේ.. මනමාලියන්ගේ චේතනා පවසාවි දෑසේ ලතා.. රන්තෝඩු සැලේනා...//",
    "metaphor": "හිම ‍රේණු වැටෙනා සීතලේ",
    "meaning": "Very cold environment with mist",
    "source": "Mist",
    "target": "Snow"
  },
  {
    "title": "Mal viyathin bandi",
    "artist": "Senanayaka Weraliyadda,",
    "album": null,
    "releasedYear": 2014,
    "lyricist": "Senanayaka Weraliyadda,",
    "lyrics": "මල් වියනින් බැදි මහ බැද්දේ උන්..අකුරු කරන්නට නුවරට ගිය මන්..නුවර පිරීලා එරමිණි කටු වැල්ආයෙත් බැද්දට එනවා මන්මල් වියනින් බැදි මහ බැද්දේ උන්..අකුරු කරන්නට නුවරට ගිය මන්..නුවර පිරීලා එරමිණි කටු වැල්ආයෙත් බැද්දට එනවා මන්තෙන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනන් තෙදිනානේ.........තෙදිනන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනානේ......... හොයිමල් පැනි මෝරන කාලෙට බැද්දේගී පද ගොතලා තාලෙට කීවේමල් පැනි මෝරන කාලෙට බැද්දේගී පද ගොතලා තාලෙට කීවේසොර බොර වැව ලග කොමලිගේ කෝමලනුවර කොහේවත් තිබුනා නම්මල් වියනින් බැදි මහ බැද්දේ උන්..අකුරු කරන්නට නුවරට ගිය මන්..නුවර පිරීලා එරමිණි කටු වැල්ආයෙත් බැද්දට එනවා මන්තෙන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනන් තෙදිනානේ.........තෙදිනන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනානේ......... හොයිමහතුන් වෙනවාට වැඩිය හොදායි මටබැද්දේ බතාක් කර හිටියානම්මහතුන් වෙනවාට වැඩිය හොදායි මටබැද්දේ බතාක් කර හිටියානම්මල් පට ඇරුනම කුරුලු මිටේ ගැරආයෙත් බැද්දට එනවා ම්ංමල් වියනින් බැදි මහ බැද්දේ උන්..අකුරු කරන්නට නුවරට ගිය මන්..නුවර පිරීලා එරමිණි කටු වැල්ආයෙත් බැද්දට එනවා මන්මල් වියනින් බැදි මහ බැද්දේ උන්..අකුරු කරන්නට නුවරට ගිය මන්..නුවර පිරීලා එරමිණි කටු වැල්ආයෙත් බැද්දට එනවා මන්තෙන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනන් තෙදිනානේ.........තෙදිනන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනානේ......... හොයිතෙන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනන් තෙදිනානේ.........තෙදිනන් තෙදිනන් තෙදිනන් තෙදිනන්තෙදිනානේ......... හොයි",
    "metaphor": "නුවර පිරීලා එරමිණි කටු වැල්",
    "meaning": "Town has a lot of harmful things",
    "source": "harmful things",
    "target": "Thorn vines"
  },
  {
    "title": "Jeewithaye hondama hariya",
    "artist": "Chamara Weerasinghe",
    "album": null,
    "releasedYear": "2013",
    "lyricist": "Chamara Weerasinghe",
    "lyrics": "ජීවිතයේ හොදම හරියඅවුල් වෙලා යද්දීතමා අතට තම අතවත්සෙවනක් නැති වෙද්දීවිරිත්තන්ඩ දහස් ගනන්මග බලාන ඉද්දීනුඹට සැපක් දෝමේ ඇස් කදුලින් තෙත් වෙද්දීමල් නටුවට පිණිබිදුවක්බර වැඩි නැති හින්දාමල් රේනුව හිස නමානමේ ලෝකෙට වැන්දාහින පොකුරු හිත පුරෝනාඅපි කසාද බැන්දාමංගල රෑ එලිවෙනතුරුනුඹ සමාව යැද්දාජීවිතයේ හොදම හරියඅවුල් වෙලා යද්දීතමා අතට තම අතවත්සෙවනක් නැති වෙද්දීවිරිත්තන්ඩ දහස් ගනන්මග බලාන ඉද්දීනුඹට සැපක් දෝමේ ඇස් කදුලින් තෙත් වෙද්දීමුළු ලෝකෙට හොද මූනක්පෙන්නන්නට හන්දාඔබ වෙනුවෙන් මේ වෙනතුරුඅපමණ දුක් වින්දාතව දුරටත් ඒ ගැන නම්කියන්න බැරි හන්දාගැනියකට සමාව දීරැවටුනාද මන්දාජීවිතයේ හොදම හරියඅවුල් වෙලා යද්දීතමා අතට තම අතවත්සෙවනක් නැති වෙද්දීවිරිත්තන්ඩ දහස් ගනන්මග බලාන ඉද්දීනුඹට සැපක් දෝමේ ඇස් කදුලින් තෙත් වෙද්දී",
    "metaphor": "මල් නටුවට පිණිබිදුවක්බර වැඩි නැති හින්දා",
    "meaning": "Live forever with life partner",
    "source": "Life partner",
    "target": "Water on the flower"
  },
  {
    "title": "Therunado Wisal Adare",
    "artist": "Yasas Medagedara",
    "album": null,
    "releasedYear": "2022",
    "lyricist": "Shehan Galahitiyawa ",
    "lyrics": "තේරුනාදෝ විසල් ආදරේපෑරී රිදුනා සුසුම් ආකහේසද නිව්නා සුපෙම් ජීවිතේපෑරුනාදෝ ඔබෙත් මා වගේදෑස රුව අහසේ පායාදෑස මත සේදී සේයාසිත සිරවී සොයයි ආදරේබිදුන සිත රහසේ පාරාකදුළු පිනි දෑසේ රූරාසිහින ගානේ සොයයි ආදරේආ. ලං වෙවී වෙන් වුනිපෑරුනි... තේරුනිපාරා සිතින් මා සදාආ. ආදරේ මාරුතේවෑහුනි... පාවුනිවෙන්වී හැගුම් දී ඈ ගියාසිහින ගානේ සුපෙම් වී තියාදෑස මානේ වහන් වී ගියාදෑස රුව අහසේ පායාදෑස මත සේදී සේයාසිත සිරවී සොයයි ආදරේරිදුනි සිත රහසේ පාරාකඳුළු පිනි දෑසේ රූරාසිහින ගානේ සොයයි ආදරේතේරුනාදෝ විසල් ආදරේපෑරී රිදුනා සුසුම් ආකහේසද නිව්නා සුපෙම් ජීවිතේපෑරුනාදෝ ඔබෙත් මා වගේදෑස රුව අහසේ පායාදෑස මත සේදී සේයාසිත සිරවී සොයයි ආදරේබිදුන සිත රහසේ පාරාකදුළු පිනි දෑසේ රූරාසිහින ගානේ සොයයි ආදරේආ... ආ...සිත සිරවී සොයයි ආ... දරේසිත සිරවී සොයයි ආ... දරේ",
    "metaphor": "කදුළු පිනි දෑසේ රූරා",
    "meaning": "Tearing up",
    "source": "Tears",
    "target": "Dew"
  },
  {
    "title": "Prakampitha",
    "artist": "Supun Perera",
    "album": null,
    "releasedYear": "2020",
    "lyricist": "Shehan Galahitiyawa ",
    "lyrics": "ප්රකම්පිත චිත්තා ශක්තිනීඅකම්පිත මාතා භක්තිනීමන සාර චිත්තාකර්ශනීධරක ප්රේමිණීප්රකම්පිත චිත්තා ශක්තිනීඅකම්පිත මාතා භක්තිනීමන සාර චිත්තාකර්ශනීධරක ප්රේමිණීInstrumentsඅග්නි වර්ශා දිවිය අවුරාපුරා සඳ විලසින් පැහැදුල් මන නොසැලේසලිත නොවෙමින් මනසින් පවාසරතැස දරයි මන ගැඹුරේසුසුම් උහුලා රිදුම් ඉවසාදරා ළය පතුලින් දිවි ගිම් දිවිකතරේඅචල හැඟුමින් පියවර තබාවිදසුන් වඩයි දිවි මාරුතේප්රකම්පිත චිත්තා ශක්තිනීඅකම්පිත මාතා භක්තිනීමන සාර චිත්තාකර්ශනීධරක ප්රේමිණීධරක ප්රේමිණීධරක ප්රේමිණීධරක ප්රේමිණීධරක ප්රේමිණීධරණී",
    "metaphor": "දිවි මාරුතේ",
    "meaning": "Journey of life",
    "source": "Life",
    "target": "Road"
  },
  {
    "title": "Gindara",
    "artist": "Dhanith Sri",
    "album": null,
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "හීන ආකර හදට කැන්දා මගේ හදවත රැගෙන ගිය ඒ..ඇගේ හැඩයම තියෙන රූබරියේ..මගේ මුවගට වැටෙන බිදුවේ හිතේ දුක් ගිනි දියව දියවේ..දුවන රුධිරේ මධුවිතට පෙරලේ..ආදරේ ගීතයක්ව පාවී ආවේ..රස මාරුතේක මා ගිලුනේ..හැරදා ගියත් මා මේ තුන් ලෝකේ..නුඹේ රහට මත්වී යමි නිවඩුවට හදේ..දැවෙන ගින්දර පපුව ඇතුලේනිවාගන්නට නුඹ රැඳෙන්නේ..මගේ අත උඩ නුඹ රැගුම දෙන්නේ..දුන්න තාලෙට අඩිය තැබුවේ..මගේ වන්නමේ නමක් නැත්තේ..හිතේ දුක නෑ මට ඉතිරි වෙන්නේ.",
    "metaphor": "ආදරේ ගීතයක්ව පාවී ආවේ",
    "meaning": "Received love",
    "source": "Love",
    "target": "Song"
  },
  {
    "title": "Digasiye",
    "artist": "Dhanith Sri",
    "album": "Alokawarsha",
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "දිගැසියේදිගැසියේකොපුල් තෙමා හිටි හැටියේඈ ඇවිද ගියා තරු පලසේහීන මවාලාඈත ගියා දැන්මා මිය යයි හද ගැස්මේකොපුල් තෙමා හිටි හැටියේඈ ඇවිද ගියා තරු පලසේහීන මවාලාඈත ගියා දැන්මා මිය යයි හද ගැස්මේමායාවන් හංගමිසේයාවක් වත් නොදීඇගෙ රූ මා ඈතින් වින්දෙමිරූපයේ මන බන්දනීප්රේමයේ අනුරාගිනීවේදනාවේ මා තනිවෙමිදිගැසියේදිගැසියේදිගැසියේදිගැසියේරූ අඳුන් ගල්වන්නියේමා හැඟුම් රිදවන්නියේරූපයෙන් මන මා මත්වෙමිරාත්රියේ සඳවන් මුවේනිල් නුවන් සිපගන්නෙමිමේ සිහිනේ මා නවතිමිදිගැසියේදිගැසියේදිගැසියේදිගැසියේදිගැසියේදිගැසියේ",
    "metaphor": "මා මිය යයි හද ගැස්මේ",
    "meaning": "I feel strong emotions",
    "source": "Strong emotions",
    "target": "Death"
  },
  {
    "title": "Adariye",
    "artist": "Dhanith Sri",
    "album": "Alokawarsha",
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "නුඹගේ චායාරූ අතරේ මා හාඇදීලාමතකේ පුරාවිසිරී ගියාසිත මාසොඳුරේ නුඹ මාදෙස නොබලා බලාගියදාසසරේ පුරානුඹ මගෙම තමාසිතුණාආදරියේආදරියේආදරියේආදරියේනුඹවේ චන්දාතරු අතරේ පායාදිලෙනානොදොඩා ගියදානෙත් අඳුරේ වර්ෂාහැලුනාසැනෙකින් බැඳෙනාසිත මන්මත් කරනාඅඟනානුඹ රූ වරුනානැත ලොවෙහී කිසිදාදැක මාආදරියේආදරියේආදරියේආදරියේ",
    "metaphor": "නෙත් අතරේ වර්ෂා හැලුනා",
    "meaning": "Cried",
    "source": "Tears",
    "target": "Rain"
  },
  {
    "title": "Wedikawe",
    "artist": "Dhanith Sri",
    "album": "Alokawarsha",
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "වේදිකාවේමේ රාත්රී යාමේනුඹ ගැන මතකේ අවදි කලාපාලු යාමේමදු මී පෙවෙන්නේනුඹ නැති ලෝකේ තනිව මෙමාජීවිතේට නුඹ ආවදිනයේම ලංවෙන්න සිතුනාටරෑ මා එක්කපියමැන්නසිපගත්තනුඹේ අතගන්නදිවිදෙන්නසිතුනත් මටනුඹ නෑ නෑ අද ළඟවේදනාවේමා ගිලෙන්නේදෙනෙතින් තෙමී කඳුළැල් සලාමං මුලාවේතනි වී තැවෙන්නේනුඹ නැති හීනේ උරුම නිසාජීවිතේට නුඹ ආවදිනයේම ලංවෙන්න සිතුනාටරෑ මා එක්කපියමැන්නසිපගත්තනුඹේ අතගන්නදිවිදෙන්නසිතුනත් මටනුඹ නෑ නෑ අද ළඟ",
    "metaphor": "නුඹ නැති හීනේ උරුම නිසා",
    "meaning": "Because I'm destined for a future without you",
    "source": "Future",
    "target": "Nightmare"
  },
  {
    "title": "Roja",
    "artist": "Dhanith Sri",
    "album": "Alokawarsha",
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "රෝජා නුඹ අද හවසත් එනවදරෝජා නුඹ මා තනිකර යනවදරෝජා තව එක බැල්මක් දෙනවදරෝජා නුඹයි ආලේ මාගේආකාසයෙන් ආ ලඳේ..දෙව්දූකවන් රූපෙ මාගේ..දෝරේ ගලයි ආදරේ..මේ රැය නුඹ මා ළඟ නැති හන්දා..නුඹ ගැන මතකය සිහිනෙක රන්දා..මා තනියම වින්දේ..මේ රැය නුඹ මා ළඟ නැති හන්දා..නුඹ ගැන මතකය සිහිනෙක රන්දා..මා තනියම වින්දේ..කඳුරැල්ලේ ලන්දේ පායා සිනාසේ..මල් වාරේ ඇවිදින් මෙහේ..දෙකොපුල් විලේහී හසරැල් පිපේවී..හැඟුමන් හදේ යාවෙවී..ආලේ හැඟුම්..ප්‍රේමේ පැතුම්..ඇතිරූ සිතින් මා මෙහේ..හිඳිමී ඉතින්..නෙතුකැන් පියන්..එයිදෝ සොයා මා කෙරේ..රෝජා නුඹ තනියම අද එනවද..රෝජා අද නුඹ මාගේ වෙනවද..රෝජා නුඹ තව ඈතට යනවද..රෝජා නුඹයි ආලෙ මාගේ..ආකාසයෙන් ආ ලඳේ..දෙව්දූකවන් රූපෙ මාගේ..දෝරේ ගලයි ආදරේ..මේ රැය නුඹ මා ළඟ නැති හන්දා..නුඹ ගැන මතකය සිහිනෙක රන්දා..මා තනියම වින්දේ..මේ රැය නුඹ මා ළඟ නැති හන්දා..නුඹ ගැන මතකය සිහිනෙක රන්දා..මා තනියම වින්දේ..",
    "metaphor": "ආකාසයෙන් ආ ලඳේ..",
    "meaning": "Heavenly girl",
    "source": "Girl",
    "target": "Angel"
  },
  {
    "title": "Ananthe Pura",
    "artist": "Dhanith Sri",
    "album": "Alokawarsha",
    "releasedYear": "2020",
    "lyricist": "Dhanith Sri",
    "lyrics": "ලයේ සතපා මා බාලයේ හොවා..සිතේ දුක් සාගරේ දරා මා නිසා..කාලයක් ගෙවී දැඩි වූවත් මගේ..සිතින් දරන්න බෑ නොමැති නම් ළඟ මගේ..පවසන්නම් ඉතින් ඇසෙයිනම් හඬ මගේ..දරා වේදනා මා කුසයේ දරාලා නුඹ සිටියා මගේ අම්මේ..සදා මාලිගා මා හර්දේම හංගා නුඹ සිටියා මගේ තාත්තේ..නුඹේ පැතුමන් මා නිසා පසෙක ලා..මගේ මුලු ලෝකයේ පුරා හැඩකලා..නොසෙල්වී මහා පොළවේ පය ගසා..සිටින්නේ නුඹේ මහමෙරක් ගුණ නිසා..වසන්තේ මගෙයි නුඹ මගේ ළඟ නිසා..ලෝකේ දුටුවා මා..මිනිසුන් හ්ඳුනයි මා..බැඳීමෙන් මගේ..මිඳී යන්න දැන්..අනන්තේ පුරාලෝකේ දුටුවා මා..මිනිසුන් හ්ඳුනයි මා..බැඳීමෙන් මගේ..මිඳී යන්න දැන්..අනන්තේ පුරාලෝකේ දුටුවා මා..මිනිසුන් හ්ඳුනයි මා..බැඳීමෙන් මගේ..මිඳී යන්න දැන්..අනන්තේ පුරාලෝකේ දුටුවා මා..මිනිසුන් හ්ඳුනයි මා..බැඳීමෙන් මගේ..මිඳී යන්න දැන්..අනන්තේ පුරා",
    "metaphor": "සදා මාලිගා මා හර්දේම හංගා",
    "meaning": "Giving me a hopeful personality",
    "source": "Hope",
    "target": "Castle"
  },
  {
    "title": "Lakmawuni",
    "artist": "Mihindu Ariyaratne",
    "album": null,
    "releasedYear": "2019",
    "lyricist": "Savindra Madushan",
    "lyrics": "[Ridma]විකසිත වී නිතිඑකමුතු වීසවිබල පා සැමඑඩිතර වී[Ranga]රුහිරය දී දිනුලක් මව්නීගරුකල සේ නුඹසෙවනෙ හිදීදරුකැල සේ නුඹසෙවනේ හිදී[Dhanith]පියමනිනාරළු මාවත දිගේජය ටැබ වේදද බදීනා දිනේ[Supun Perera]නිම නොවෙනාහද මඩලේ සෙනේනිති සැදුනේඑක මව්නේ[Kanchana]බිද දමලා රළුපවුරු බැදීමිතුදම වේ අපඅතරෙ සැදී[Supun Perera]මනු දෙරණේනොම නොගැටි අපීලොව දිනමූ සිහජය ගොස දී[Ridma & Kanchana]ලොව දිනමූ සිහජය ගොස දී[Ranga]පියමනිනාරළු මාවත දිගේජය ටැබ වේදද බදීනා දිනේ[Dhanith]නිම නොවෙනාහද මඩලේ සෙනේනිති සැදුනේඑක මව්නේ[Fawaz]රතු රුහිරේ ලයෙසැරුවේ අපේකුමකට දෝ පිල්බෙදිලා මෙසේ[Heshan]ලග දකිනා නෙතු පිසදාලා[Prageeth]අපි සැවොමා එක රැහැනේ වෙලී[Ranura]අපි සැවොමා එක රැහැනේ වෙලී[All Togethe]පිය මනිනාජය මාවත දිගේඅපි සැවොමාඑක් වී",
    "metaphor": "අපි සැවොමා එක රැහැනේ වෙලී",
    "meaning": "We are all united",
    "source": "Unity",
    "target": "A single wire"
  },
  {
    "title": "Datha dara",
    "artist": "Ridma Weerawardane",
    "album": "Datha dara",
    "releasedYear": "2020",
    "lyricist": "Nisal Gamage",
    "lyrics": "දෑත දරා ඇවිදින් ආදරයෙන්මා වෙනුවෙන් හිඳිනා අයුරුමිදෙමි දැහැනෙන් හැඟුමන් පාමුලසිත් වාරු බිඳෙයි ඔබ ළඟ මියුරුසේද වලා අතුරාලා සඳ පායාඇති රෑ තුරුලේ ගෙවමුමා පැතු ඒ යුග නෙත් ආදර හිත්ආදරයෙන් හමුවීමයි හිමි වූමනහාරී නුරාවී නෙතු මානේ සිනාසීතව ළං වී පෙමින් දම් ගොතමිගිම්හානේ තුහීන ගේනාඔබෙන් මා නිවෙමි සදා කල් හිඳිමිතරු යායේ පුරා හඳ මාගේවලාවකින් මාගේ ආලේ ලියමිසේද වලා අතුරාලා සඳ පායාඇති රෑ තුරුලේ ගෙවමුමා පැතු ඒ යුග නෙත් ආදර හිත්ආදරයෙන් හමුවීමයි හිමි වූදෑත දරා ඇවිදින් ආදරයෙන්මා වෙනුවෙන් හිඳිනා අයුරුමිදෙමි දැහැනෙන් හැඟුමන් පාමුලසිත් වාරු බිඳෙයි ඔබ ළඟ මියුරු",
    "metaphor": "ගිම්ගානේ තුහීන ගෙනා ඔබෙන් මා නිවෙමී",
    "meaning": "Your love relaxes me and cools me",
    "source": "Relaxation from love",
    "target": "Change of Summer to Winter"
  },
  {
    "title": "Ma Prarthanawe",
    "artist": "Supun Perera",
    "album": null,
    "releasedYear": "2022",
    "lyricist": "Supun Perera",
    "lyrics": "ඔබ ගීයක් වී ආවේ වස්සාන කාලේහද මාරුතේ ගිනි නිවාසිත සිහිලැල් වූ යාමේ රෑ තාරකාවේඅපෙ ආදරේ එහි ලියාමා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේලැමැදේ මගේ ඈ හොවාඈ ප්‍රාර්ථනාවේ මා මුවඟ ගොලුවේදුරකින් දුකින් මා දවාපෑ එදා ආලවන්තයේ සිනාදෑසින් රහසින්ම යා වුණාපෑ එදා ආලවන්තයේදෑසින් රහසින්ම යා වුණාදිවුරා කියන්නම් ස්නේහේ නමින්අරමුණ මගේ ඔබ වුණාමා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේලැමැදේ මගේ ඈ හොවාරෑ පුරාම හීන පීරලානෑනේ තාම අපිව හමුවෙලාහාදු එව්වේ සුලඟේ දවටලාහංග හංග උන්නු කාරණානින්ද නේන රෑක එලිවුණාආපු දුරක මතකේ සිහිවුණාපාර කියපු ගීතේ තනුව මා සදා වුණාමා ප්‍රාර්ථනාවේ ඈ දෑස දැල්වේලැමැදේ මගේ ඈ හොවාඈ ප්‍රාර්ථනාවේ මා මුවඟ ගොලුවේදුරකින් දුකින් මා දවා",
    "metaphor": "ඔබ ගීයක් වී ආවේ",
    "meaning": "You came into my life",
    "source": "Girl",
    "target": "Song"
  },
  {
    "title": "Sitha ananthaye radila sanda sedi",
    "artist": "Kaveesha Kaviraj",
    "album": null,
    "releasedYear": "2019",
    "lyricist": "Imesh Wijebandara",
    "lyrics": "සිත අනන්තයේ රැදිලා සද සේදිලුනා දිලුනා දිලුනා දිලුනාජීවිතයේ කවුළු හැම වසන්තයෙඅපි තුරුළු වෙවීවින්දා වින්දා වින්දා වින්දාඋමතු කදුළු සුළි කුණාටුවක් වී විනාශයක්මැවුනා මැවුනා මැවුනා මැවුනාරකුසු වෙස් මකුළි ඉඩෝරයේරළු පොලවක් සේදැවුනා දැවුනා දැවුනා දැවුනාවේදනා බුබුලුදූවිලි කුණාටුවේ පාවෙනසුර කුමාරියේඇසුනා සැම කතා බහේපිරිහී ඔබ සමාජයේමා නොසිතූ විරාමයේනවතීමට ලගා උනේමායා නෙත තරාදියේ කියලා ඔබ පලාගියේසිත අනන්තයේ රැදිලා සද සේදිලුනා දිලුනා දිලුනා දිලුනාජීවිතයේ කවුළු හැම වසන්තයෙඅපි තුරුළු වෙවීවින්දා වින්දා වින්දා වින්දාඋමතු කදුළු සුළි කුණාටුවක් වී විනාශයක්මැවුනා මැවුනා මැවුනා මැවුනාරකුසු වෙස් මකුළි ඉඩෝරයේරළු පොලවක් සේදැවුනා දැවුනා දැවුනා දැවුනාවේදනා බුබුලුපාවෙන වලාතිරේ සදබාගෙට ගිලී ගියේඔබ නැති මේ නුරා රැයේගිම්හානය පවා සැලේදෑස පුරා ඇදුනා කැලබූසිතුවිලි සේනාදින් තාරු සෙනේ දියවී සංසාරේ පුරා මැවුනා",
    "metaphor": "දූවිලි කුනාටුවේ පාවෙන සුරකුමාරියේ",
    "meaning": "Girl living in a bad society",
    "source": "Bad society",
    "target": "Storm"
  },
  {
    "title": "Amma kiyala",
    "artist": "Jude Rogans",
    "album": null,
    "releasedYear": "2016",
    "lyricist": "Dilan Gamage",
    "lyrics": "අම්මා කියලා බහ තෝරනාවයසේ ඉදලා නැතුවම බැරි උනාගන්නා හුස්මන් පවා නැලවිලි ගීයක් උනා...මග හැරුනාද අම්මාව පෙම් කරනදා මා පෙම් කරනදා..හිමාලෙට වඩානේ ඔබ පෙම් කරානේමහමෙර තරමට දරු දුක දරා..ජාතිත් ඔබයිනේ..සසරෙම පතන්නේ..හැම බවයේ එනු මාගෙ අම්මා වෙලා..අනුකම්පා කරලා දෙන්න පුතාට සමා..වෙනසක් නොකරමි මා මගෙ අම්මාට සසරෙ පුරා..අම්මෙ ඔබ වාගෙ කව්රුත් ම නෑ හමුවෙලා..මට නෑ හමු වෙලා..අම්මා කියලා //...",
    "metaphor": "හුස්මන් පවා නැලවිලි ගීයක් උනා",
    "meaning": "Every words of a mother is lovely",
    "source": "Mother's words",
    "target": "Poems"
  },
  {
    "title": "Adare oben danunu tharam",
    "artist": "Pradeep Rangana",
    "album": "Obagen Tharam",
    "releasedYear": "2017",
    "lyricist": "Pradeep Rangana",
    "lyrics": "ආදරේ ඔබෙන් දැනුනු තරම්දැවි දැවි හිතම වෙලුනු තරම්ආදරේ ඔබෙන් දැනුනු තරම්දැවි දැවි හිතම වෙලුනු තරම්ජීවිතේ සතුට මේ තරම්නැහැ දැනුනේ මේ ලෝකේමට ලැබුණු ඔබගෙන් තරම්නැහැ දැනුනේ මේ ලෝකේමට ලැබුණු ඔබගෙන් තරම්ඔබ මැවු පද පෙලින්මා හදේ ගීතයක් ලීවානොමැකෙනා පද වලින්ජීවිතේ තනුව මම ලීවාඋපදිනා මතු හැම භවේමං ඉන්නවා ඔබගේ පපුතුරුලේ උණුහුම වෙලාමං ඉන්නවා ඔබගේ පපුතුරුලේ උණුහුම වෙලාකටු මතින් යන ජීවිතේමල් වලින් අපි සරසමුඔබේ හැඟුම් මගේ කියාසම සිතින් අපි විදගමුඋපදිනා මතු හැම භවේමං ඉන්නවා ඔබගේ පපුතුරුලේ උණුහුම වෙලාමං ඉන්නවා ඔබගේ පපුතුරුලේ උණුහුම වෙලාආදරේ ඔබෙන් දැනුනු තරම්දැවි දැවි හිතම වෙලුනු තරම්ආදරේ ඔබෙන් දැනුනු තරම්දැවි දැවි හිතම වෙලුනු තරම්ජීවිතේ සතුට මේ තරම්නැහැ දැනුනේ මේ ලෝකේමට ලැබුණු ඔබගෙන් තරම්නැහැ දැනුනේ මේ ලෝකේමට ලැබුණු ඔබගෙන් තරම්",
    "metaphor": "කටු මතින් යන ජීවිතේ",
    "meaning": "Hard life journey with challenges",
    "source": "Life challenges",
    "target": "Thorns"
  },
  {
    "title": "Kiriweherata",
    "artist": "Chamara Weerasinghe",
    "album": "Best of Chamara",
    "releasedYear": "2010",
    "lyricist": "Chamara Weerasinghe",
    "lyrics": "කිරිවෙහෙරට යන පාරේමල් විකුණන මගෙ සීදේවීසිදාදියෙන් එන දෙවිවරුමලක් වගේ හිත ඉල්ලාවී…කිරිවෙහෙරට යන පාරේමල් විකුණන මගෙ සීදේවීසිදාදියෙන් එන දෙවිවරුමලක් වගේ හිත ඉල්ලාවීනිල් මානෙල් මලකට වැඩිඇස් දෙක ලස්සනයි කියාවී…නිල් මානෙල් මලකට වැඩිඇස් දෙක ලස්සනයි කියාවී…ලස්සන ඒ ඇසිපිය යටහීන තියා සුවඳ ගනිවීකිරිවෙහෙරට යන පාරේමල් විකුණන මගෙ සීදේවීසිදාදියෙන් එන දෙවිවරුමලක් වගේ හිත ඉල්ලාවීමල් වික්කට කාසි වලටනගරෙට හිත නොදෙන් දයාවී…මල් වික්කට කාසි වලටනගරෙට හිත නොදෙන් දයාවී…මගෙ හිත කිරිවෙහෙර වගේසත්තයි පිවිතුරුයි ප්‍රියාවීකිරිවෙහෙරට යන පාරේමල් විකුණන මගෙ සීදේවීසිදාදියෙන් එන දෙවිවරුමලක් වගේ හිත ඉල්ලාවී",
    "metaphor": "සිදාදියෙන් එන දෙවිවරු",
    "meaning": "Rich people are coming from the town to the village",
    "source": "Rich people",
    "target": "Gods"
  },
  {
    "title": "Beddata sanda wage",
    "artist": "Chamara Weerasingha",
    "album": null,
    "releasedYear": "2010",
    "lyricist": "Roshan Fernando",
    "lyrics": "බැද්දට සඳ වගේ ගෝමරි මල් මද කැකුළියේරන්දාපාමිනේ නැතියේ රන්කඳ වී මගේමං බැද්දේ ගොහින් බමර කොටක්ගෙනැල්ලා දෙන්නම්ගම් බැද්දෙ ගොහින් ගෝතම් පොජ්ජක්ගෙනැල්ල දෙන්නම්මහ හූරෝ සහේට ගන්නට හැදුවටයන්ට එපා උඹ යන්ට එපාහිත්ලෑව මේ ඇත්තෝ අහක දමාහිත්ලෑව මේ ඇත්තෝ අහක දමාමහ බල ඇති කළු බණ්ඩාර දෙවියන්ටයදිනවා මං යදිනවාමගෙ ගෑනි සහේට ගන්ට හිතාමගෙ ගෑනි සහේට ගන්ට හිතා",
    "metaphor": "බැද්දට සඳ වගේ",
    "meaning": "Beautiful girl",
    "source": "Girl",
    "target": "Moon"
  },
  {
    "title": "Mage punchi rosa mala",
    "artist": null,
    "album": "Sanduda Awadiyen",
    "releasedYear": "2000",
    "lyricist": null,
    "lyrics": "මගේ පුංචි රෝස මලේමමයි නුඹේ වියපත් බඹරානුඹ හීනෙන්වත් නොදකින කුමරා...කළුවර රෑ සඳක් වගේඅහසේ නුඹ ඉන්නවනම්...ආසයි මම නොකී කවියනුඹට කියන්න...තරහක් නැහැ නුඹ බැස යන්න...මගේ පුංචි නවාතැනේඇවිදින් සැරි සරනවනම්...ආසයි මං කවුළු පියන්ඇරලා තියන්න...තරහක් නැහැ නෑවිත් ඉන්න...මගේ පුංචි රෝස මලේමමයි නුඹේ වියපත් බඹරානුඹ හීනෙන්වත් නොදකින කුමරා...",
    "metaphor": "මමයි නුඹේ වියපත් බඹරා",
    "meaning": "A mature person loves a young one",
    "source": "Mature person",
    "target": "Old wasp"
  },
  {
    "title": "Gammane",
    "artist": "Costa",
    "album": null,
    "releasedYear": "2021",
    "lyricist": "Costa",
    "lyrics": "ගම්මානේ සොඳුරු සෝබානුඹේ රූමත් රුව මට ඕනානුඹේ රාගී නෙතඟින් අද ඉඟිබිඟි පානාමම ආස විදියට මට ආලේ ඕනාරෑ බෝ වී එනකොට මම සාලේ නෝනානෑ මගේ හිතේ වල්කම්දෙන්නම් මම දම් ලස්සන රුව රන්වන්නුඹේ මත්වුනු ඇස් දෙක මට සුරලෝ වදනම්එන්නම් පියඹා යන් අහසේ නෑ මට දැන් සිතියම්වැස්සක් ආවොත් තෙමෙන්න ආසයි නුඹ හා බලන්න තෙත්වුනු තන්Snap වෙන්නෑ හැබැයි මං ගමේ කොල්ලෙක් මමසරම උඩින් ඇන්දේ උන්–ක පු– බෙල්ට් එකමගේ බැල්මේ දිස්නේ දෙන්නේ කියුම ලින්ක් එකකෙල්ලේ මට දුන්නොත් අතබූලිය පෙරලං හොයන්න ආසයි මං බං කසිප්පුකෝඩ්ට් රෙඩ් ලේබල් වොඩ්කා ඕනෑ බං ගහන්න මට දැන් අරක්කුබඩු ටික අතටම ගෙනැල්ලා දුන්නම ඇයි බන් ඔතන්න උඹ දැන් පරක්කුදඩ මස් බයිට් එක ටොප්හැබැයි වැඩි බං දැන් ටික මස් අරක්කුබස්වල යන්නෑ මං ආසයි අදින්න ට්‍රැක්ටර්Facebook වගේ දැන් මං පිටු පෙල්ලන් බලන්නේ ලක්බිම පත්තරේරෑ බෝ වෙනකොට ආසයි බූ:Start වුනා මගේ ජෙනරේටරේආතල් ගන්නට නුඹ හා මට හැංගිගංතෙර වගේ මං අන්දරේgirl you look good in that dressbaby come over here, put your hand in my chestand I ain’t got time to obsessbut I love you like diamonds and you vvsI know you ain’t fugaziif I gave you to my jeweler you passing the testyou know I never get lazywhen you tell your friends about me you saying the bestso bad I could wait for ityou look like an angel I can’t even tell if you realprivate show and I paid for ityou know I’m famous and ill put you on get you a dealand when I play games I winill-treat you like royalty make sure you know I’m a stealmy sight so razor-thinI can’t see anything but you let me cop me a feelI know I’m young but I been in the game for a minuteill make you push all your limitsyou ain’t never been with a playerI’ll show you what you could be sippingYeah, my life is amazing baby do you wanna be in it?Yeah, I could take you for the ridebut do you wanna be driven?when I hit that gas I’m a monstertake you with me everywhere imma conquerwhen I’m in your sheets I’m a doctorwhen I hit the top 200 I’m a topperI ain’t gotta lie about a thing babyEvery time I’m in it I’m going berserkI’m pretty and know how to sing babyI could take you to dinner have you for dessertso bad I could wait for ityou look like an angel I can’t even tell if you realprivate show and I paid for ityou know I’m famous and ill put you on get you a dealand when I play games I winill-treat you like royalty make sure you know I’m a stealmy sight so razor-thinI can’t see anything but you let me cop me a feelගම්මානේ සොඳුරු සෝබානුඹේ රූමත් රුව මට ඕනානුඹේ රාගී නෙතඟින් අද ඉඟිබිඟි පානාමම ආස විදියට මට ආලේ ඕනාරෑ බෝ වී එනකොට මම සාලේ නෝනානෑ මගේ හිතේ වල්කම්දෙන්නම් මම දම් ලස්සන රුව රන්වන්නුඹේ මත්වුනු ඇස් දෙක මට සුරලෝ වදනම්එන්නම් පියඹා යන් අහසේ නෑ මට දැන් සිතියම්වැස්සක් ආවොත් තෙමෙන්න ආසයි නුඹ හා බලන්න තෙත්වුනු තන්",
    "metaphor": "රාගී නෙතඟින්",
    "meaning": "Sensual eyes",
    "source": "Eye",
    "target": "Lust"
  },
  {
    "title": "Unmadini",
    "artist": "Bathiya and Santhush",
    "album": "Tharunyaye",
    "releasedYear": "2002",
    "lyricist": null,
    "lyrics": "උන්මාදනී හැංගුණා අනුරාග දෑසින් බලා සොඳුරුයි සුපෙම් ලෝචනා නෑසෙයි නුඹේ ගායනා දෙනුවන් සෙවූ අංගනා රාධා මගේ අංජනා මල් මී සුගන්ධේ නැළැවී වෙළී මල්වැල් ගොතන්නී වෘන්දා වනේ නිල්විල් තලාවේ කිමිදී මිදී කොයිදැයි විදින්නේ සැන්දෑ සුවේ රන්මිණි මෙවුල්දම් බිදෙනා වෙලේ කෝ කොයිද රාධා උන්මාදනී ගෝපීලියන් හා යමුනා තෙරේ අවුදින් මුලා වූ රධා මගේ වස්සානයේ ආ මේ කුළුවලින් සංතාපයේ ලා පොද වෑහුනී රන්මිණි මෙවුල්දම් බිදෙනා වෙලේ කෝ කොයිද රාධා උන්මාදනී උන්මාදනී හැංගුණා අනුරාග දෑසින් බලා සොඳුරුයි සුපෙම් ලෝචනා නෑසෙයි නුඹේ ගායනා දෙනුවන් සෙවූ අංගනා රාධා මගේ අංජනා",
    "metaphor": "අනුරාග දෑසින් බලා",
    "meaning": "Watching from lustful eyes",
    "source": "Eyes",
    "target": "Lust"
  },
  {
    "title": "Ko enna",
    "artist": "Ravindra Meegamaarachchi",
    "album": "Jock Jam",
    "releasedYear": "2012",
    "lyricist": null,
    "lyrics": "හෝ එන්නහෝ එන්නහීත දියේ බැස නාගෙන මේ අරුමැද්දේපුළුලුකුලට ඇලවුණු දිය රෙද්ද වගේතෙත කොණ්ඩය බිම ගෑවේ නුඹේ හැඩට හැඩේමානවිකා කිමන ශ්රියා නා නන්නා නේහැංගී හැංගී බැන්දූමාල පොටක් මුතු ඇමුණූනිල් වරලස හැඩ ගැන්වූපිච්ච මලින් මල රැන්දූදුහුල් සීත ගත දැවටූපාද සළඹ හඬ නැංවූනාරි ශ්රියා මන බැන්දූමට හිමි වේවිද ලන්දූකෝ එන්න කෝ එන්නතූනෙ ජෝගු ලායා තේරේකෝ එන්න කෝ එන්නප්රීති වී ගයා නටාතූනෙ ජෝගු ලායා තේරේ සංග ඩෝතා ජාවු මේනෑසුණා නුඹෙ ගායනාපාලුවේ මා තනි වුනාදෑස් අතරින් බොඳ වුනාසරාගී දෙනුවන් සදාඇසුවන් මන පිනවන ගී නද ගයන අගේදුටුවන් මන බන්දන රූ සිරි පිරි වරුණේතනිකඩ මට මොට මේ සරදම් ළමිස්සියේනුඹ කීවට මං කොහොමද එන්නෙ නඟේකෝ එන්න කෝ එන්නප්රීති වී ගයා නටාතූනෙ ජෝගු ලායා තේරේ එන්න එන්න මේ දිහාකෝ හරි යා නරි සංග මේරේ ඩෝලරේතූනෙ ජෝගු ලායා තේරේ සංග ඩෝතා ජාවු මේ",
    "metaphor": "නිල් වරලස",
    "meaning": "Shining beautiful hair",
    "source": "Hair",
    "target": "Blue"
  },
  {
    "title": "Ikman Wela",
    "artist": "Sajeewa Dissanayake",
    "album": "Ikman Wela",
    "releasedYear": "2016",
    "lyricist": null,
    "lyrics": "මට ලැබුණු හැමදේට වැඩියෙන් සදාවටිනාම දේ වූ ඔයාපෙර පිනට මුණගැහුණු බව තේරුනාදුටු මුල් දිනේ දී පවාඉක්මන් වෙලාඅනන්තෙන් එහාපියාඹන්නේ නෑ මා වසන්තය දමාආදරයේ ප්රාතිහාර්යයක් වී ඔයාකළුවර මගේ දිවිය එලි කල නිසාදහසක් දෙනා අද කතා වෙනවා ඇසුනාදෙවියන් ලු මැව්වේ මා වෙත ඔයාකෙතරම් බාධා ආවත් සොයාහැරයන්න හැකි වූයේ සැනෙකින් මෙදාපණටත් වඩා කාටත් අත නොපාඔබෙන් ලද සදා නිකලැල් ආදරේ නිසාආදරයේ ප්රාතිහාර්යයක් වී ඔයාකළුවර මගේ දිවිය එලි කල නිසාදහසක් දෙනා අද කතා වෙනවා ඇසුනාදෙවියන් ලු මැව්වේ මා වෙත ඔයාඉක්මන් වෙලාඅනන්තෙන් එහාපියාඹන්නේ නෑ මා වසන්තය දමාආදරයේ ප්රාතිහාර්යයක් වී ඔයාකළුවර මගේ දිවිය එළිය කළාදහසක් දෙනා අද කතා වෙනවා ඇසුනාදෙවියන් ලු මැව්වේ මා වෙත ඔයා",
    "metaphor": "පියාඹන්නේ නෑ මා වසන්තය දමා",
    "meaning": "I will not leave this joyful moments",
    "source": "Joyful moment",
    "target": "Spring"
  }
]